/**
 * @file lv_ime_pinyin.c
 *
 */

/*********************
 *      INCLUDES
 *********************/
#include "lv_ime_pinyin.h"
#if LV_USE_IME_PINYIN != 0

#include <stdio.h>

/*********************
 *      DEFINES
 *********************/
#define MY_CLASS    &lv_ime_pinyin_class

/**********************
 *      TYPEDEFS
 **********************/
extern int keyboard_type; //0:小写;1:大写
extern int symbol_type;//0：中文；1：英文；2：中文；3：英文
/**********************
 *  STATIC PROTOTYPES
 **********************/
static void lv_ime_pinyin_constructor(const lv_obj_class_t * class_p, lv_obj_t * obj);
static void lv_ime_pinyin_destructor(const lv_obj_class_t * class_p, lv_obj_t * obj);
static void lv_ime_pinyin_style_change_event(lv_event_t * e);
static void lv_ime_pinyin_kb_event(lv_event_t * e);
static void lv_ime_pinyin_cand_panel_event(lv_event_t * e);

static void init_pinyin_dict(lv_obj_t * obj, lv_pinyin_dict_t * dict);
static void pinyin_input_proc(lv_obj_t * obj);
static void pinyin_page_proc(lv_obj_t * obj, uint16_t btn);
static char * pinyin_search_matching(lv_obj_t * obj, char * py_str, uint16_t * cand_num);
static void pinyin_ime_clear_data(lv_obj_t * obj);

/**********************
 *  STATIC VARIABLES
 **********************/
const lv_obj_class_t lv_ime_pinyin_class = {
    .constructor_cb = lv_ime_pinyin_constructor,
    .destructor_cb  = lv_ime_pinyin_destructor,
    .width_def      = LV_SIZE_CONTENT,
    .height_def     = LV_SIZE_CONTENT,
    .group_def      = LV_OBJ_CLASS_GROUP_DEF_TRUE,
    .instance_size  = sizeof(lv_ime_pinyin_t),
    .base_class     = &lv_obj_class
};

static char   lv_pinyin_cand_str[LV_IME_PINYIN_CAND_TEXT_NUM][4];
static char * lv_btnm_def_pinyin_sel_map[LV_IME_PINYIN_CAND_TEXT_NUM + 3];

#if LV_IME_PINYIN_USE_DEFAULT_DICT
#if 0
lv_pinyin_dict_t lv_ime_pinyin_def_dict[] = {
    { "a", "啊" },
    { "ai", "愛" },
    { "an", "安暗案" },
    { "ba", "吧把爸八" },
    { "bai", "百白敗" },
    { "ban", "半般辦" },
    { "bang", "旁" },
    { "bao", "保薄包報" },
    { "bei", "被背悲北杯備" },
    { "ben", "本" },
    { "bi", "必比避鼻彼筆秘閉" },
    { "bian", "便邊變変辺" },
    { "biao", "表標" },
    { "bie", "別" },
    { "bing", "病並氷" },
    { "bo", "波薄泊" },
    { "bu", "不布步部捕補歩" },
    { "ca", "察" },
    { "cai", "才材菜財採" },
    { "can", "参残參" },
    { "ce", "策側" },
    { "ceng", "曾" },
    { "cha", "差查茶" },
    { "chai", "差" },
    { "chan", "產産單" },
    { "chang", "場廠" },
    { "chao", "超朝" },
    { "che", "車" },
    { "cheng", "成程乗" },
    { "chi", "尺吃持赤池遅歯" },
    { "chong", "充种重種" },
    { "chu", "出初楚触處処" },
    { "chuan", "川船傳" },
    { "chuang", "創窓" },
    { "chun", "春" },
    { "ci", "此次辞差" },
    { "cong", "從従" },
    { "cu", "卒" },
    { "cun", "存村" },
    { "cuo", "錯" },
    { "da", "大打答達" },
    { "dai", "代待帯帶貸" },
    { "dan", "但担擔誕單単" },
    { "dang", "当党當黨" },
    { "dao", "到道盗導島辺" },
    { "de", "的得" },
    { "dei", "" },
    { "deng", "等" },
    { "di", "地得低底弟第締" },
    { "dian", "点电店點電" },
    { "diao", "調" },
    { "ding", "定町" },
    { "dong", "冬東動働凍" },
    { "du", "独度都渡読" },
    { "duan", "段断短斷" },
    { "dui", "對対" },
    { "duo", "多駄" },
    { "e", "嗯悪" },
    { "en", "嗯" },
    { "er", "而耳二兒" },
    { "fa", "乏法發発髪" },
    { "fan", "反返犯番仮販飯範払" },
    { "fang", "方放房坊訪" },
    { "fei", "非飛費" },
    { "fen", "分份" },
    { "feng", "風豐" },
    { "fou", "否不" },
    { "fu", "父夫富服符付附府幅婦復複負払" },
    { "gai", "改概該" },
    { "gan", "甘感敢" },
    { "gang", "港剛" },
    { "gao", "告高" },
    { "ge", "各格歌革割個" },
    { "gei", "給" },
    { "gen", "跟根" },
    { "geng", "更" },
    { "gong", "工共供功公" },
    { "gou", "夠構溝" },
    { "gu", "古故鼓" },
    { "guai", "掛" },
    { "guan", "官管慣館觀関關" },
    { "guang", "光広" },
    { "gui", "規帰" },
    { "guo", "果国裏菓國過" },
    { "hai", "孩海害還" },
    { "han", "寒漢" },
    { "hang", "航行" },
    { "hao", "好号" },
    { "he", "合和喝何荷" },
    { "hei", "黒" },
    { "hen", "很" },
    { "heng", "行横" },
    { "hou", "厚喉候後" },
    { "hu", "乎呼湖護" },
    { "hua", "化画花話畫劃" },
    { "huai", "壊劃" },
    { "huan", "緩環歡還換" },
    { "huang", "黄" },
    { "hui", "回会慧絵揮會" },
    { "hun", "混婚" },
    { "huo", "活或火獲" },
    { "i", "" },
    { "ji", "己计及机既急季寄技即集基祭系奇紀積計記済幾際極繼績機濟" },
    { "jia", "家加價" },
    { "jian", "件建健肩見減間検簡漸" },
    { "jiang", "降強講將港" },
    { "jiao", "叫教交角覚覺較學" },
    { "jie", "介借接姐皆届界解結階節價" },
    { "jin", "今近禁金僅進" },
    { "jing", "京境景静精經経" },
    { "jiu", "就久九酒究" },
    { "ju", "句具局居決挙據舉" },
    { "jue", "角覚覺" },
    { "jun", "均" },
    { "kai", "開" },
    { "kan", "看刊" },
    { "kang", "康" },
    { "kao", "考" },
    { "ke", "可刻科克客渇課" },
    { "ken", "肯" },
    { "kong", "空控" },
    { "kou", "口" },
    { "ku", "苦庫" },
    { "kuai", "快塊会會" },
    { "kuang", "況" },
    { "kun", "困" },
    { "kuo", "括拡適" },
    { "la", "拉啦落" },
    { "lai", "来來頼" },
    { "lao", "老絡落" },
    { "le", "了楽樂" },
    { "lei", "類" },
    { "leng", "冷" },
    { "li", "力立利理例礼離麗裡勵歷" },
    { "lian", "連練臉聯" },
    { "liang", "良量涼兩両" },
    { "liao", "料" },
    { "lie", "列" },
    { "lin", "林隣賃" },
    { "ling", "另令領" },
    { "liu", "六留流" },
    { "lu", "律路録緑陸履慮" },
    { "lv", "旅" },
    { "lun", "輪論" },
    { "luo", "落絡" },
    { "ma", "媽嗎嘛" },
    { "mai", "買売" },
    { "man", "滿" },
    { "mang", "忙" },
    { "mao", "毛猫貿" },
    { "me", "麼" },
    { "mei", "美妹每沒毎媒" },
    { "men", "們" },
    { "mi", "米密秘" },
    { "mian", "免面勉眠" },
    { "miao", "描" },
    { "min", "民皿" },
    { "ming", "命明名" },
    { "mo", "末模麼" },
    { "mou", "某" },
    { "mu", "母木目模" },
    { "na", "那哪拿內南" },
    { "nan", "男南難" },
    { "nao", "腦" },
    { "ne", "那哪呢" },
    { "nei", "内那哪內" },
    { "neng", "能" },
    { "ni", "你妳呢" },
    { "nian", "年念" },
    { "niang", "娘" },
    { "nin", "您" },
    { "ning", "凝" },
    { "niu", "牛" },
    { "nong", "農濃" },
    { "nu", "女努" },
    { "nuan", "暖" },
    { "o", "" },
    { "ou", "歐" },
    { "pa", "怕" },
    { "pian", "片便" },
    { "pai", "迫派排" },
    { "pan", "判番" },
    { "pang", "旁" },
    { "pei", "配" },
    { "peng", "朋" },
    { "pi", "疲否" },
    { "pin", "品貧" },
    { "ping", "平評" },
    { "po", "迫破泊頗" },
    { "pu", "普僕" },
    { "qi", "起其奇七气期泣企妻契気" },
    { "qian", "嵌浅千前鉛錢針" },
    { "qiang", "強將" },
    { "qiao", "橋繰" },
    { "qie", "且切契" },
    { "qin", "寝勤親" },
    { "qing", "青清情晴輕頃請軽" },
    { "qiu", "求秋球" },
    { "qu", "去取趣曲區" },
    { "quan", "全犬券" },
    { "que", "缺確卻" },
    { "ran", "然" },
    { "rang", "讓" },
    { "re", "熱" },
    { "ren", "人任認" },
    { "reng", "仍" },
    { "ri", "日" },
    { "rong", "容" },
    { "rou", "弱若肉" },
    { "ru", "如入" },
    { "ruan", "軟" },
    { "sai", "賽" },
    { "san", "三" },
    { "sao", "騒繰" },
    { "se", "色" },
    { "sen", "森" },
    { "sha", "砂" },
    { "shan", "善山單" },
    { "shang", "上尚商" },
    { "shao", "少紹" },
    { "shaung", "雙" },
    { "she", "社射設捨渉" },
    { "shei", "誰" },
    { "shen", "什申深甚身伸沈神" },
    { "sheng", "生声昇勝乗聲" },
    { "shi", "是失示食时事式十石施使世实史室市始柿氏士仕拭時視師試適実實識" },
    { "shou", "手首守受授" },
    { "shu", "束数暑殊樹書屬輸術" },
    { "shui", "水説說誰" },
    { "shuo", "数説說" },
    { "si", "思寺司四私似死価" },
    { "song", "送" },
    { "su", "速宿素蘇訴" },
    { "suan", "算酸" },
    { "sui", "隨雖歲歳" },
    { "sun", "孫" },
    { "suo", "所" },
    { "ta", "她他它牠" },
    { "tai", "太台態臺" },
    { "tan", "探談曇" },
    { "tang", "糖" },
    { "tao", "桃逃套討" },
    { "te", "特" },
    { "ti", "体提替題體戻" },
    { "tian", "天田" },
    { "tiao", "条條調" },
    { "tie", "鉄" },
    { "ting", "停庭聽町" },
    { "tong", "同童通痛统統" },
    { "tou", "投透頭" },
    { "tu", "土徒茶図" },
    { "tuan", "團" },
    { "tui", "推退" },
    { "tuo", "脱駄" },
    { "u", "" },
    { "v", "" },
    { "w", "王" },
    { "wai", "外" },
    { "wan", "完万玩晩腕灣" },
    { "wang", "忘望亡往網" },
    { "wei", "危位未味委為謂維違圍" },
    { "wen", "文温問聞" },
    { "wo", "我" },
    { "wu", "午物五無屋亡鳥務汚" },
    { "xi", "夕息西洗喜系昔席希析嬉膝細習係" },
    { "xia", "下夏狭暇" },
    { "xian", "先限嫌洗現見線顯" },
    { "xiang", "向相香像想象降項詳響" },
    { "xiao", "小笑消效校削咲晓" },
    { "xie", "写携些解邪械協謝寫契" },
    { "xin", "心信新辛" },
    { "xing", "行形性幸型星興" },
    { "xiong", "兄胸" },
    { "xiu", "休秀修" },
    { "xu", "須需許續緒続" },
    { "xuan", "選懸" },
    { "xue", "学雪削靴學" },
    { "xun", "訓訊" },
    { "ya", "呀押壓" },
    { "yan", "言顔研煙嚴厳験驗塩" },
    { "yang", "央洋陽樣様" },
    { "yao", "要揺腰薬曜" },
    { "ye", "也野夜邪業葉" },
    { "yi", "一已亦依以移意医易伊役異億義議藝醫訳" },
    { "yin", "因引音飲銀" },
    { "ying", "英迎影映應營営" },
    { "yong", "永用泳擁" },
    { "you", "又有右友由尤油遊郵誘優" },
    { "yu", "予育余雨浴欲愈御宇域語於魚與込渔" },
    { "yuan", "元原源院員円園遠猿願" },
    { "yue", "月越約楽" },
    { "yun", "雲伝運" },
    { "za", "雑" },
    { "zai", "在再載災" },
    { "zang", "蔵" },
    { "zao", "早造" },
    { "ze", "則擇責" },
    { "zen", "怎" },
    { "zeng", "曾增増" },
    { "zha", "札" },
    { "zhai", "宅擇" },
    { "zhan", "站展戰戦" },
    { "zhang", "丈長障帳張张" },
    { "zhao", "找着朝招" },
    { "zhe", "者這" },
    { "zhen", "真震針" },
    { "zheng", "正整争政爭" },
    { "zhi", "之只知支止制至治直指值置智値紙製質誌織隻識職執" },
    { "zhong", "中种終重種眾" },
    { "zhou", "周州昼宙洲週" },
    { "zhu", "助主住柱株祝逐注著諸屬術" },
    { "zhuan", "专專転" },
    { "zhuang", "状狀" },
    { "zhui", "追" },
    { "zhun", "準" },
    { "zhuo", "着" },
    { "zi", "子自字姉資" },
    { "zong", "總" },
    { "zuo", "左做昨坐座作" },
    { "zu", "足祖族卒組" },
    { "zui", "最酔" },
    { "zou", "走" },
    {NULL, NULL}
};
#endif

#if 1

lv_pinyin_dict_t lv_ime_pinyin_def_dict[] = {
    { "a", "啊阿呵吖嗄腌锕錒" },
    { "ai", "爱愛矮挨哎碍礙癌艾唉哀蔼藹隘埃皑皚嗌嫒嬡瑷璦暧曖捱砹嗳噯锿鎄霭靄乂伌僾儗凒剀剴叆呃呝啀嘊噫堨塧壒奇娭娾嵦懓懝敱敳昹欬欸毐溰溾濭烠焥皧瞹硋磑絠薆諰譪譺賹躷醷鑀閡阂阨阸隑靉餲馤騃鯦鱫鴱崖" },
    { "an", "按安暗岸俺案鞍氨胺庵揞犴铵銨桉谙諳鹌鵪埯垵黯侒儑匼厈咹唵啽垾堓婩媕屽峖晻洝玵痷盒盦盫碪罯腤荌菴萻葊蓭裺誝豻貋遃鉗錌钳闇陰隂隌雸鞌韽頇頞顸馣鮟鴳鶕" },
    { "ang", "昂肮盎卬岇昻枊醃醠骯" },
    { "ao", "袄襖凹傲奥熬懊敖翱澳拗媪廒骜驁嗷坳遨聱螯獒鏊鳌鼇鏖岙嶴厫嗸噢嚻囂垇墺墽奡奧媼嫯岰嶅慠扷抝摮擙柪梎泑滶澚熝爊獓璈眑磝磽礉翶翺芺蔜蝹謷謸軪郩鏕镺隞鰲鴁鴢鷔" },
    { "ba", "把八吧爸拔罢罷跋巴芭扒坝壩霸叭靶笆疤耙捌粑茇岜鲅钯鈀魃菝灞仈叐哱哵坺垻墢夿妭峇弝抜抪捭朳杷柭欛湃炦犮玐癹皅矲笩紦羓胈茷萆蚆覇詙豝跁軷釛釟颰魞鮁鮊鲃鲌鼥" },
    { "bai", "百白摆擺败敗柏拜佰伯稗捭掰庍拝挀栢猈竡粨粺絔薭襬贁鞁鞴韛" },
    { "ban", "半办辦班般拌搬版斑板伴扳扮瓣颁頒绊絆癍坂钣鈑舨阪瘢坢埿姅岅怑搫攽斒昄朌柈湴瓪秚籓粄肦蝂螁螌褩覂豳跘辧辨辩辯辬鉡闆靽魬鳻" },
    { "bang", "帮幫棒绑綁磅镑鎊邦榜蚌傍梆膀谤謗浜蒡嗙垹埲塝嫎峀崗幇幚徬挷捠搒棓牓玤硥稖縍艕蚄蛖蜯螃邫鞤騯髈" },
    { "bao", "保包抱报報饱飽暴薄宝寶爆剥豹雹褒堡苞胞鲍鮑炮龅齙孢煲褓鸨鴇趵葆佨儤剝勹勽嘐嚗堢媬嫑寚寳忁怉曓枹珤砲窇笣簿緥菢蕔藵虣蚫袌裒裦襃賲鉋鑤铇闁靌靤飹駂骲髱鳵宀" },
    { "be", "萡" },
    { "bei", "被北倍杯备備贝貝背悲碑卑辈輩钡鋇焙狈狽惫憊臂褙悖蓓鹎鵯鐾呗唄邶鞴韝孛陂碚俻俾偝偹僃哱喺垻埤怫愂揹昁杮柸桮梖棑棓椑牬犕珼琲痺盃禙箃糒苝茀菩萆萯葡藣蛽蜚襬誖諀跋軰鄁鉳錍鐴骳" },
    { "ben", "本奔苯笨锛贲賁畚坌倴喯夲奙捹撪桳楍泍渀炃燌犇獖翉蟦輽逩錛鐼" },
    { "beng", "蹦绷繃甭崩迸蚌泵甏嘣伻俸傰唪嗙埄埲堋塴奟嵭挷搒榜漨熢琣琫痭祊絣綳菶跰逬錋鏰镚閍鞛" },
    { "bi", "比笔筆闭閉币幣必鼻碧避逼毕畢臂彼鄙壁蓖弊辟蔽毙斃庇敝陛毖痹秘泌秕薜荸芘萆匕裨畀俾嬖狴筚篳箅篦舭荜蓽襞庳铋跸蹕吡愎滗濞璧哔嗶髀弼妣婢仳佊佖佛偪匂卑咇啚坒埤堛夶奰妼娝媲嬶屄崥幤庀廦弻彃怭怶悂愊拂捭旇朼枇枈柀柲梐椑楅檗殍毴沘波湢滭潷煏熚獘獙珌畁畐疕疪痺皀皕瞥禆稫笓箃箄箆粃粊紕紴綼縪繴纰罷罼翍聛肶肸胇脾腗腷苾萞蘗蜌螕袐被襅襣觱詖诐豍貏貱費贔赑跛踾躃躄邲鄨鄪鈚鉍錍鎞鏎鐴鐾閇閈閟闬陂陴鞁鞞鞸韠飶饆馝馥駜驆髲魓魮鮅鮩鰏鲾鴓鵖鶝鷝鷩鸊鼊" },
    { "bian", "边邊变變便编編遍辩辯扁贬貶鞭卞辨辫辮忭砭匾汴碥蝙褊鳊鯿笾籩苄窆弁缏緶煸変峅徧惼抃拚揙昪汳炞牑猵獱甂疺稨稹箯糄臱艑萹藊覍覵豍辡辦辧邉邲鍽閞鞕頨鯾鴘鶣髟" },
    { "biao", "表标標彪膘婊飑颮飙飆鳔鰾瘭飚颷镳鑣裱骠驃镖鏢俵僄儦剽墂幖徱摽檦淲滮漂瀌灬熛爂猋穮篻脿膔臕蔈藨褾諘謤贆錶鏖飇飈飊驫骉麃髟" },
    { "bie", "别憋鳖鱉瘪癟蹩別咇彆徶捌撆撇柭柲猰秘穪苾莂蔽虌蛂蟞襒鼈龞" },
    { "bin", "宾賓濒瀕摈擯彬斌滨濱膑臏殡殯缤繽髌髕傧儐鬓鬢镔鑌玢椕氞汃濵瑸璸砏虨蠙訜豩賔贇赟邠霦顮髩鬂豳" },
    { "bing", "并並病兵冰丙饼餅秉柄炳摒槟檳禀邴仌併倂偋傡冫垪寎幷庰怲抦掤昞昺栟栤梹棅氷燷燹琕癛癝眪稟窉竝絣綆绠苪蛃誁跰鈵鉼鋲陃靐鞆鞞鞸餠鮩疒" },
    { "bo", "拨撥波播博搏脖伯泊驳駁玻剥剝薄勃菠钵缽帛柏舶渤铂鉑箔膊卜蔔礴跛亳啵簸檗鹁鵓踣钹鈸饽餑擘仢侼僠僰募哱噃嚗壆妭孛孹嶓帗彴愽懪拔挬擗柭桲榑檘欂殕泼浡淿湐潑煿牔犦犻狛猼瓝瓟癶發皪盋砵碆磻礡秡穛箥簙簿糪紴肑胉艊艴苩茀茷葧蔢薜蘖蘗蚾袚袯袹襎襏襮詙譒豰趵蹳郣鉢鋍鎛鑮镈餺馎馛馞駮驋髆髉鮁鮊鱍鲅鲌" },
    { "bu", "不步补補布部捕簿哺堡埠怖埔瓿逋晡钸鈽钚鈈醭卟佈僕勏吥咘埗婄尃峬庯廍悑抪拊捗捬撲擈柨歨歩溥獛秿箁篰荹蔀薄誧踄輹轐郶陠鞴餔餢鯆鳪鵏鸔" },
    { "ca", "擦礤嚓傪囃攃橴磣礸遪" },
    { "cai", "才菜采材财財彩裁蔡猜踩睬倸偲啋埰婇寀戝扐採揌棌綵縩纔跴" },
    { "can", "餐灿燦参參蚕蠶残殘掺惨慘惭慚骖驂璨孱黪粲傪儏叄叅喰嘇噆囋嬠嬱嵾慙憯戔摲朁淺湌澯爘穇篸薒蝅蠺謲蹔鏒飡飱鯵鰺鲹黲" },
    { "cang", "藏仓倉沧滄舱艙苍蒼伧傖仺凔匨嵢欌濸獊瑲篬罉臧蔵螥賶鑶鶬鸧" },
    { "cao", "草操曹槽糙嘈艚螬漕傮屮嶆愺慅慒懆撡曺澡肏艸艹蓸褿襙鄵鏪鐰騲鼜" },
    { "ce", "测測册冊侧側策厕廁恻惻厠墄嫧帻幘憡拺敇柵栅畟笧筞筴箣簎粣荝萗萴蓛齰刂" },
    { "cen", "岑涔叄叅嵾梣汵硶穇笒篸膥" },
    { "ceng", "曾层層蹭噌嶒橧竲繒缯驓" },
    { "ceok", "硛硳" },
    { "ceom", "岾" },
    { "ceon", "猠" },
    { "ceor", "乽" },
    { "cha", "查插叉茶差察岔搽茬碴刹诧詫楂槎镲衩汊馇餷檫姹杈锸鍤嚓仛侘偛剎嗏垞奼岎嵖扠扱挿捈揷摖査梌猹疀秅紁肞臿艖芆苴荖褨訍詧蹅釵銟鎈鑔钗靫喳" },
    { "chai", "柴拆差豺钗釵瘥虿蠆侪儕勑喍囆扠犲祡茈茝蔕袃訍齜龇" },
    { "chan", "产產缠纏铲鏟婵嬋掺摻搀攙阐闡颤顫蝉蟬谗讒馋饞忏懺觇覘蒇蕆谄諂冁囅廛孱蟾羼镡鐔潺禅禪骣驏躔澶丳亶佔僝僤儃儳兎刬剗剷劖単啴嘽嚵團墠壥嬗嵼嶃嶄巉幝幨憚懴摌摲撣斺旵梴棎榐欃毚浐湹滻漸潹瀍瀺灛煘燀獑産硟磛簅緂緾繟繵纒脠艬苫螹蟺袩裣襝裧襌襜誗譂讇讖谶蹍辿鄽酁醦鉆鋋鋓鑱镵閳韂" },
    { "chang", "长長昌常厂廠场場尝嘗肠腸畅暢唱偿償敞倡嫦裳猖鲳鯧昶怅悵苌萇氅菖惝徜鬯阊閶伥倀娼仧倘僘儻兏厰嚐塲尙晿棖椙淐焻玚琩瑒瑺瓺甞畼脹膓蟐裮誯鋹鋿錩鏛锠镸闛韔鱨鲿鼚" },
    { "chao", "朝超潮巢钞鈔炒抄吵嘲怊焯耖晁仦仯劋勦巐巣弨摷槱樔欩漅濤焣煼牊眧窲粆綤縐繛绉罺觘訬謅謿趠趫轈鄛麨鼂鼌" },
    { "che", "车車撤扯掣彻徹澈坼砗硨伡俥偖勶呫唓喢夛奲屮揊摰撦烢烲焎爡瞮硩聅莗蛼詀謵迠頙" },
    { "chen", "称稱辰臣尘塵晨沉陈陳趁衬襯秤琛忱郴榇櫬抻谌諶碜磣谶讖宸龀齔嗔伧傖侲儭嚫塡墋夦愖捵揨敐曟桭棧棽樄瀋烥煁疢瘎瘨眈瞋硶綝肜胂茞莀莐蔯薼螴訦諃謓謲賝贂趂趻跈踸軙迧醦鈂鍖霃鷐麎齓" },
    { "cheng", "称稱成乘城橙诚誠程承撑撐呈惩懲逞骋騁澄晟盛塍柽檉埕铖鋮噌铛鐺酲裎枨蛏蟶丞瞠乗侱偁僜埩堘塖娍宬峸嵊庱徎悜憆憕挰掁摚摤撜朾棖棦椉樘橕橖檙氶泟洆浈湞浧浾淨溗澂瀓瀞爯牚珵珹琤瑲畻睈矃碀穪窚竀筬絾緽脀脭荿虰觕赪赬踜郕郢鎗鏳鏿阷靗頳饓騬鯎黨秤" },
    { "chi", "吃尺池翅驰馳弛持赤齿齒迟遲痴癡耻恥斥侈炽熾匙踟坻茌墀饬飭媸豉褫敕哧瘛蚩啻鸱鴟眵螭篪魑叱彳笞嗤傺佁侙俿剟勅卙卶叺呎呬呮呹喫嘨嘯噄噭坘垑奓妛屟岻彨彲徲恜慗慸憏懘扡抶拸捇搋摛摴攡杘柅柢樆欼歗歭歯汖沱沶泜淔湁漦灻烾狋瓻痓痸瘈眙瞝竾筂箈箎粚糦絺翄翤翨耛肔胝胣胵脪腟芪荎菭蚇蚳蝭袲袳裭訵誀誃誺謘謻貾赿趍趐趩跅跢跮踅踶軧迡迣遅遟遫邌鉓鉹銐鍉雴餝饎騺鳷鵄鵣鶒鶗鶙鷘麶黐齝郗" },
    { "chong", "充宠寵冲衝沖虫蟲崇憧忡舂重铳銃艟茺偅傭僮喠嘃埫崈徸憃揰摏樁浺漴潼爞珫痋盅祌緟罿翀蝩褈蹖蹱酮隀" },
    { "chou", "抽愁臭仇丑醜稠绸綢酬筹籌踌躊畴疇瞅惆俦儔帱幬瘳雠丒侴偢吜嚋婤媿嬦怞懤扭掫搊擣杻杽栦椆檮殠溴燽牰犨犫畤皗盩眣矁篘紬絒臰菗薵裯詶謅譸讎讐诪跾遚酧醔醻鈕雔魗鮘鯈鲋" },
    { "chu", "出处處初除畜厨廚楚础礎储儲滁触觸橱櫥锄鋤矗搐躇雏雛楮杵刍芻怵绌絀亍憷蹰躕黜蜍樗俶傗儊処嘼埱媰岀幮慉懨拀摢摴敊斶椘榋槒橻檚櫉櫖欪歜滀濋炪犓珿琡璴竌竐篨耝耡臅菆蒢蒭蓫蕏藸蟵蠩褚觕諔诎詘诸諸豖豠貙趎跦踀踰鄐鉏閦鶵鸀齣齭齼屮" },
    { "chua", "欻歘" },
    { "chuai", "揣膪啜搋踹欼腄膗" },
    { "chuan", "穿船传傳串川喘钏釧椽氚遄舡舛巛僢剶圌堾掾暷歂汌猭玔瑏甎篅膞舩荈賗踳輲镩鑹鶨" },
    { "chuang", "窗床创創闯闖疮瘡幢怆愴仺倉傸刅刱剏剙噇囪摐朣橦漴漺牀牎牕磢窓窻膧" },
    { "chui", "吹垂炊锤錘捶槌棰陲倕圌埀惙搥桘箠腄菙郵鎚顀鬌魋龡" },
    { "chun", "春唇纯純蠢醇淳鹑鶉椿蝽莼蓴蒓偆僢堾媋惷旾暙朐杶楯槆橁櫄沌浱湻滣漘犉瑃睶箺肫胊脣膞芚萅萶賰踳輇輴辁醕錞陙鯙鰆鶞" },
    { "chuo", "戳绰綽踔啜龊齪辍輟吷嚽娕娖婥婼孎惙拺擉斫歠涰淖焯磭箹繛腏蔟趠趵跿辵辶逴酫鋜錣鏃鑡镞齱" },
    { "ci", "次此词詞瓷慈磁辞辭刺赐賜雌茨伺祠糍疵呲鹚鶿佌佽偨刾呰啙垐堲姕嬨庛朿枱柌栜栨泚澬濨玼珁甆皉礠粢絘縒胔茈茦茲莿萕薋蛓螅螆蠀赼趀趑跐辝辤鈶飺餈骴髊鮆鴜鷀齹" },
    { "cis", "嗭" },
    { "cong", "从從丛叢葱蔥匆聪聰囱囪琮枞樅淙璁骢驄苁蓯偬傯婃孮従徖忩怱悤悰慒憁暰棇楤樬樷欉漎漗潀潈潨灇焧熜燪爜瑽瞛碂篵総緫縦總繱纵縱聡聦茐菆藂蟌誴謥賨賩鏦騘" },
    { "cou", "凑湊楱辏腠蔟輳" },
    { "cu", "粗醋簇促卒猝憱徂蔟蹙酢殂蹴卆噈娕娖媨怚捽瘄瘯皻縬绉縐脨蔍蔖觕誎趗趥踀踓踤踧蹵顣麁麄麆麤鼀" },
    { "cuan", "窜竄蹿躥篡攒攢汆爨镩鑹撺攛僔巑攅櫕欑殩濽灒熶穳窾篹簒菆襸鋑" },
    { "cui", "催脆摧翠崔淬瘁粹璀啐悴萃毳榱乼伜倅凗啛墔崒崪嶉忰慛椊槯漼濢焠熣獕琗疩皠磪竁粋紣綷縗繀缞翆脃脺膬膵臎襊趡踤鏙隹顇" },
    { "cun", "村寸存忖皴侟刌吋墫拵洊浚澊竴籿踆邨" },
    { "cuo", "错錯撮搓挫措磋嵯锉銼厝鹾鹺脞痤蹉瘥矬剉剒夎嵳庴摧棤澨營瑳睉縒莝莡蒫蓌蔖虘襊諎躜躦逪遳酂酇醝髊齹" },
    { "da", "大答达達打搭瘩笪耷哒噠沓遝褡怛靼妲嗒鞑韃亣剳匒呾咑垯墶憚搨撘橽毼汏溚炟燵畗畣眔矺笚繨羍荅荙薘蟽觰詚跶躂迏迖逹鎉鎝鐽龖龘" },
    { "dai", "带帶代戴待袋贷貸岱黛呆逮歹怠傣殆呔玳迨甙骀駘绐紿埭侢叇嘚垈帒帯廗懛曃柋汏瀻獃瑇箉簤緿艜蔕蚮蝳螮襶诒詒跢蹛軑軚軩轪逯遞遰霴靆鮘鴏黱" },
    { "dan", "但单單蛋淡丹旦担擔弹彈胆膽耽氮诞誕掸撣郸鄲惮憚石疸澹瘅癉萏殚殫眈聃箪簞赕賧儋啖丼亶伔倓僤儃冄刐勯匰単呾唌啗啿嘾噉噡嚪妉娊媅帎弾怛惔愖憺抌撢柦欿沊泹澶澸燀狚玬瓭甔疍癚皽砃禫窞紞繵耼聸腅膻蜑蜒蟺衴褝襌襜覘觇觛訑譂贉蹛躭酖醈霮頕餤饏馾駳髧鴠黕黮黵卩亻" },
    { "dang", "当當党黨挡擋档檔荡蕩铛鐺裆襠砀碭谠讜宕菪凼氹偒儅噹圵垱壋婸崵嵣愓攩欓潒澢灙珰瑒璗璫瓽瘍盪瞊礑筜簜簹艡蘯蟷譡趤逿闣雼" },
    { "dao", "到道倒刀岛島稻导導盗盜悼蹈祷禱捣搗捯帱幬纛忉氘叨俦儔啁嘄噵壔宲屶嶋嶌嶹擣朷椡槝檤檮洮瓙禂稲箌絩翢翿舠菿薵虭衜衟裯軇醻釖陦隝隯魛鱽刂" },
    { "de", "的地得德锝鍀嘚徳恴悳惪棏淂陟" },
    { "dei", "得哋" },
    { "dem", "揼" },
    { "den", "扥扽" },
    { "deng", "等灯燈邓鄧登凳蹬澄瞪磴镫噔嶝戥簦僜墱嬁憕橙櫈璒竳艠覴豋鐙隥" },
    { "di", "地第底低敌敵抵滴帝迪递遞弟缔締堤涤滌笛狄棣翟蒂嫡谛諦觌覿邸诋詆嘀柢骶羝氐睇娣荻碲镝鏑坻籴糴砥仾俤偙僀儥厎呧唙啇啲啻嚁坔坘埅埊埞墆墑墬奃媂嵽嶳廸弔弚弤彽怟慸扚拞掋揥摕旳杕枤梊梑楴樀浟渧焍牴玓珶甋疐眱碮磾祶禘篴聜肑胝腣苐苖菂菧蔋蔐蔕藋藡蚳蝃螮袛觝諟豴赿趆踧踶蹏蹢軧逐逓適遰釱鉪鍉阺隄靮鞮頔馰髢鬄魡鯳鸐" },
    { "dia", "嗲" },
    { "dian", "点點电電店淀澱垫墊典滇巅巔甸殿颠顛碘惦癫癲掂奠佃靛踮钿鈿坫阽簟玷癜佔傎厧唸埝壂奌婝婰嵮巓扂拈攧敁敟椣槇槙橂橝湺琔痶瘨磹腍蒧蕇蜓蜔詀蹎頕顚驔齻丶" },
    { "diao", "掉钓釣吊雕刁碉凋貂调調叼铞銱铫銚鲷鯛伄倜刟奝嬥屌弔弴彫扚椆殦汈淍琱瘹瞗矵窎窵竨簓粜糶絩蓧藋虭蛁蜩訋誂轺軺鈟鋽錭鑃雿颩魡鮉鳭鵃鵰鸼鼦" },
    { "die", "爹跌叠疊碟蝶迭谍諜牒堞瓞揲蹀耋鲽鰈垤喋佚咥哋啑峌崼嵽幉怢恎惵戜挃挕昳曡柣楪槢殜氎泆渫牃畳疂疉眣眰絰绖耊胅臷艓苵蜨螲褋褺詄趃跕跮蹛轶軼鐡鐵镻鞢鮙鰨鳎" },
    { "dim", "嚸" },
    { "ding", "顶頂定订訂丁鼎钉釘酊汀盯叮锭錠町腚玎碇疔仃耵啶奵嵿帄忊掟椗濎甼矴碠磸聢艼萣葶薡虰鐤靪顁飣饤" },
    { "diu", "丢丟铥銩颩" },
    { "dong", "动動东東冻凍洞冬董栋棟懂咚胴酮侗恫峒鸫鶇垌胨腖硐氡岽崠倲働勭埬墥姛娻嬞峝崬戙挏揰昸氭涷湩烔燑狫笗筩箽絧苳菄蕫蝀衕詷諌迵霘駧騆鮗鯟鶫鼕夂" },
    { "dou", "都斗鬥豆陡抖痘兜蚪窦竇荳逗篼蔸乧侸兠凟剅吺唗斣枓梪橷毭氀浢瞗窬脰艔郖酘酡鋀钭鈄閗闘阧餖饾鬦鬪鬬鬭" },
    { "du", "读讀度堵独獨肚镀鍍杜毒渡赌賭睹督都犊犢妒笃篤嘟渎瀆椟櫝牍牘蠹黩黷髑芏儥凟剢剫匵厾噣妬嬻帾斁晵暏樚樞橐殬殰涜琽瓄皾睪秺竇笁纛荰蝳螙蠧裻襡襩覩読讟豄贕醏錖鑟锗鍺闍阇陼靯韇韣韥騳" },
    { "duan", "段短断斷端锻鍛缎緞椴煅簖籪偳剬塅媏彖毈瑖碫篅耑腶葮褍躖鍴" },
    { "dui", "对對队隊堆兑兌碓怼懟憝兊垖塠対嵟憞搥杸濧濻瀢瀩痽磓祋綐膭薱謉譈譵鈗銳鋭錞鎚鐓鐜陮頧鴭" },
    { "dul", "乧" },
    { "dun", "吨噸顿頓盾炖燉蹲钝鈍遁沌盹墩敦惇趸躉镦鐓礅炖燉砘伅墪壿庉忳憞撉撴楯橔潡犜獤碷腞腯蜳踲蹾逇遯鐜驐" },
    { "duo", "多朵夺奪舵躲剁垛跺惰堕墮哆踱哚咄铎鐸沲掇裰缍綞亸仛兊凙刴剟剫喥嚉嚲垜埵墯夛奲媠嫷尮崜嶞憜挅挆敓敚敠敪朶杕枤柁柂柮桗棰椯橢毲沰沱澤痥硾茤袳詑誃貀趓跢跥跿躱軃鈬錞鍺锗陊陏隓飿饳駄鬌鮵鵽" },
    { "e", "饿餓额額俄鳄鱷鹅鵝娥蛾扼讹訛遏峨恶惡厄鄂颚顎噩垩堊锇鋨谔諤锷鍔莪阏閼萼苊轭軛婀腭齶愕呃鹗鶚屙偔僫匎匼卾吪呝咢咹啈噁囐囮堨堮妸妿姶娾娿媕屵岋峉峩崿廅悪戹搕搤搹擜曷枙椏櫮欸歞歺涐湂玀珴琧痷皒睋砈砐砨砵硆硪磀礘胺蒍蕚蘁蚅蝁覨詻誐譌讍豟軶輵迗遌遻鈋鑩閜阨阸頞頟餩騀魤魥鰐鰪鴳鵈鵞齃齾" },
    { "ei", "诶誒欸" },
    { "en", "恩摁蒽嗯奀峎煾" },
    { "eng", "鞥" },
    { "eo", "仒" },
    { "eol", "乻" },
    { "eom", "欕" },
    { "eos", "旕" },
    { "er", "而二耳儿兒饵餌尔爾贰貳洱珥铒鉺迩邇鲕鮞鸸鴯佴侕児刵咡唲嬭尒尓峏弍弐杒栭栮樲毦洏渪粫耏聏胹荋薾衈袻誀貮趰輀輭轜陑陾隭駬髵髶" },
    { "fa", "发發髪髮法罚罰伐乏筏阀閥珐琺発垡砝佱傠姂廢彂栰橃沷灋疺瞂笩罸茷蕟藅醗醱鍅" },
    { "fan", "反饭飯番帆返凡繁翻犯泛烦煩贩販范範樊藩梵蕃幡矾礬钒釩舤舧畈笵燔蘩蹯仮伋凢凣勫匥噃墦奿婏嬎嬏嬔忛憣払拚旙旛杋柉棥楓橎氾汎渢滼瀪瀿犿璠畨盕笲籓籵緐繙羳膰舩薠蟠蠜袢襎訉軓軬轓辺鐇颿飜飰鱕鷭攵" },
    { "fang", "放房防纺紡芳方访訪仿坊妨肪钫鈁彷邡枋舫鲂倣匚埅堏旊昉昘汸淓牥瓬眆祊蚄趽錺雱髣魴鰟鳑鴋鶭" },
    { "fei", "非飞飛肥费費肺废廢菲啡妃霏翡沸匪诽誹蜚腓扉狒绯緋痱斐吠篚芾悱镄鐨榧淝鲱鯡俷剕厞墢奜婓婔屝廃怫昲暃曊朏杮柹棐橃橨櫠渄濷犻猆琲疿癈砩祓笰紼绋胇胏胐茀茇萉蕜蕟蕡蜰蟦裶襏陫靅靟飝餥馡騑騛髴鼣" },
    { "fen", "分份芬粉奋奮纷紛愤憤忿焚氛酚吩粪糞坟墳汾棼瀵鲼鱝玢偾僨鼢坆坋妢岎帉幩弅愍湣敃昐朆朌枌梤棻橨歕濆炃燌燓燔獖瞓砏秎竕羒羵翂肦膹葐蒶蕡蚠蚡衯訜豮豶躮轒鈖錀鐼隫雰餴饙馚馩魵鳻黂黺鼖" },
    { "feng", "风風封蜂丰豐枫楓奉凤鳳峰锋鋒烽逢冯馮缝縫疯瘋讽諷砜碸俸酆葑沣灃唪仹偑僼凨凬凮埄堸夆妦寷峯崶捀摓桻檒沨浲渢湗溄漨炐焨煈熢犎猦琒甮盽篈綘肨舽艂莑蘕蘴覂豊賵赗逄鄷鎽鏠靊飌鳯鴌麷覅" },
    { "fo", "佛仏仸坲梻" },
    { "fou", "否缶垺妚炰紑缹缻芣衃雬鴀" },
    { "fu", "副肤膚富福负負伏付复複服附夫父扶浮符孵妇婦腹阜幅斧府辐輻辅輔抚撫覆弗俯赴缚縛敷赋賦腐氟俘傅讣訃涪袱甫釜脯腑咐蝠孚馥驸駙芙拂黼砩苻趺跗蚨芾鲋鮒幞襆茯滏蜉拊菔鳆鰒蝮绂紱绋紼赙賻罘稃匐麸麩凫鳧桴莩怫祓呋郛艴黻乀伕俌俛偩偪冨冹刜呒嘸咈哹坿垘垺報妋姇娐婏媍嬎嬔宓尃岪峊巿帗弣彳彿復怤懯抙捊捬掊旉枎枹柎柫柭栿棴椨椱榑汱沕泭洑溥澓炥烰焤玞玸琈璷甶畉畐畗癁盙砆祔禣秿稪竎笰筟箁箙簠粰糐紨絥綍綒緮纀罦翇胕艀芣茀荂荴萉萯葍蓲蕧虙蚥蚹蛗蜅蝜衭袚袝褔襥覄詂諨豧踾軵輹邚邞郍郙鄜酜酻釡鈇鉘鉜錇鍑鍢锫阝陚鞴韝韍韨頫颫颰髴鬴鮄鮲鳬鳺鴔鵩鶝麬麱" },
    { "ga", "噶嘎旮尬咖轧軋钆釓尕尜呷嘠玍錷魀" },
    { "gad", "甴" },
    { "gai", "该該改盖蓋概钙鈣摡丐溉垓芥戤陔赅賅乢侅匃匄姟峐忋晐杚槩槪漑瓂畡磑祴絠絯胲荄葢豥賌郂鎅隑" },
    { "gan", "干幹乾感甘肝柑杆赣橄竿敢赶趕秆稈尴尷擀泔旰酐矸疳苷绀紺澉淦坩乹亁仠佄倝凎凲咁尲尶忓扞攼桿榦檊汵浛漧灨玕玵皯盰笴筸篢簳粓芉虷衦詌諴豃贑贛迀釬錎飦骭魐鰔鱤鳡鳱" },
    { "gang", "刚剛钢鋼港纲綱缸岗崗杠冈岡肛罡筻戆堈堽戅戇掆棡槓溝焵牨犅犺疘矼碙罁罓釭鎠阬颃頏" },
    { "gao", "高髙告膏羔糕稿搞篙镐鎬皋郜诰誥蒿藳缟縞睾槁藁槀稾杲槔锆鋯勂吿夰峼暠槹橰檺櫜澔獋獔皐睪祮祰禞稁筶羙臯菒韟餻鷎鷱鼛" },
    { "ge", "个個各歌哥格革割阁閣隔胳葛骼鸽鴿戈搁擱蛤疙铬鉻硌嗝咯颌頜袼塥虼圪镉鎘仡舸鬲膈搿纥紇哿佫佮匌吤呄嘅嘢噶彁愅戓戨扢挌敋杚槅櫊滆滒澔牫牱犵猲獦砝秴箇肐臈臵茖菏蓋蛒裓觡詥諽謌輵轕鉿鎑鎶铪閤鞈鞷韐韚騔髂魺鮥鮯鰪鲄鴐鴚鵅" },
    { "gei", "给給" },
    { "gen", "跟根哏茛亘亙艮揯搄" },
    { "geng", "更耕梗耿庚羹埂赓賡鲠鯁哽绠綆亙刯堩峺恆挭掶暅椩浭焿畊絙絚緪縆羮莄菮郉郠頸骾鶊鹒" },
    { "gib", "喼" },
    { "go", "嗰" },
    { "gong", "工公功共供恭贡貢宫宮弓攻拱躬巩鞏汞龚龔肱觥珙蚣匑匔厷唝嗊塨幊廾愩慐拲杛栱渱熕碽篢糼羾蛩觵贑躳輁銾髸魟龏" },
    { "gou", "够购購沟溝狗抅勾构構枸钩鈎鉤苟垢诟詬佝傋媾冓篝岣彀鞲觏缑緱笱遘呴坸夠姤搆撀泃煹玽簼耇耈耉茩蚼袧褠覯訽豰豿軥雊韝鮈鸜鸲鴝" },
    { "gu", "古股谷穀顾顧故固雇估骨姑鼓孤箍咕辜蛊蠱贾賈菇毂轂轱軲沽梏鸪鴣锢钴鈷汩崮菰鹘鶻臌酤鲴鯝诂詁牯瞽锢錮牿痼觚蛄罟嘏傦僱凅劷哌唂唃啒嗀嗗堌夃嫴尳峠崓怘愲扢抇柧棝榖榾橭櫎泒淈滑濲瀔焸瓠皷盬硲磆祻稒笟箛篐糓縎罛羖胍脵臯苽蓇薣蛌軱逧鈲頋餶馉骰鮕鼔" },
    { "gua", "挂掛刮瓜褂卦寡剐剮呱胍鸹鴰栝诖詿冎劀叧咶咼啩坬歄焻煱絓緺罣罫苽諣趏踻銛銽铦颪颳騧" },
    { "guai", "怪拐乖掴摑叏夬恠枴柺箉罫" },
    { "guan", "关關関管官观觀冠贯貫莞馆館惯慣罐灌棺纶綸盥鳏鰥鹳鸛瓘矜掼摜闗涫倌丱卝婠悹悺懽斡桄樌櫬權毌泴淉潅爟琯痯瘝癏矔礶祼窤筦罆舘菅萖蒄覌観躀輨遦錧鏆鑵閞雚鱞鱹鳤鵍" },
    { "guang", "光广廣逛犷獷咣胱桄侊俇僙垙姯広挄撗横櫎欟洸潢灮炗炚炛烡珖硄臦臩茪趪輄迋銧黆" },
    { "gui", "归歸贵貴桂柜櫃规規瑰硅矽轨軌龟龜鬼跪诡詭闺閨圭刽劊鳜鱖鲑鮭癸珪傀炔庋宄桧檜刿劌皈匦匭妫媯晷簋炅亀佹僞厬垝姽嫢嬀嶡嶲巂帰庪廆恑摫撌攰攱昋朹椝椢槣槶槻槼櫰櫷氿沩溈湀溎潙璝瓌癐瞆瞡瞶硊祪禬窐筀簂胿膭茥蓕蘬蛫螝蟡袿襘觖觤謉赽趹蹶邽郌陒隗雟鞼騩鬶鬹鱥鳺鴂鴃" },
    { "gun", "滚滾棍辊輥衮袞鲧鯀绲緄惃棞琯璭睔睴緷蓘蔉裷謴锟錕鮌鰥鳏丨" },
    { "guo", "过過国國果锅鍋郭裹涡渦帼幗蝈蟈聒掴摑埚堝椁槨虢馘猓崞呙咼蜾咶啯嘓囗囯囶囻圀埻墎彉彍惈慖敋楇櫎活淉漍濄瘑矌簂粿綶聝腂腘膕菓蔮蜮蝸蠃褁輠鈛錁鐹锞餜馃" },
    { "ha", "哈蛤铪鉿奤妎丷" },
    { "hai", "还還海害氦孩骸嗨亥咳骇駭醢胲侅咍嗐嚡塰拸欬烸猲絯郂酼阂閡頦颏餀饚駴" },
    { "hal", "乤" },
    { "han", "含汗寒汉漢韩韓焊翰瀚涵旱喊罕撼捍憾酣悍邯鼾函憨邗菡撖顸頇蚶焓颔頷晗仠佄傼兯凾厈咁哻唅嚂圅垾娢嫨屽崡嵅忓扞攼旰晘晥暵桿梒椷榦欦歛汵浛浫涆淊淦澉澏澣熯爳猂琀甝皔睅矸笒筨糮肣莟蔊蘫虷蛿蜬蜭螒譀谽豃釬鈐銲鋎鋡钤閈闬雗靬頜顄顩馠馯駻鬫魽鳱鶾" },
    { "hang", "行航夯杭沆颃頏绗絎珩垳妔忼斻桁炕笐筕苀蚢貥迒邟酐魧" },
    { "hao", "好号號浩皓毫豪耗昊蚝蠔郝壕蒿薅嚎颢灏嚆嗥濠傐儫呺哠嘷噑恏悎昦晧暠暤暭曍椃淏滈滜澔灝獆獋皜皞皡皥秏竓籇翯聕膠臯茠薃薧藃虠諕譹鄗鎒鐞顥鰝" },
    { "he", "合和喝河禾核盒荷贺賀鹤鶴何呵赫褐菏劾阖闔阂閡涸郃吓嚇貉嗬盍翮颌壑诃訶纥曷佫呙咼咊哬啝嗃噈垎姀寉峆惒愒抲挌敆柇楁欱毼洽渮湼澕焃煂熆熇燺爀犵狢癋皬盇盉碋礉秴篕籺粭紇翯萂藃藿蚵螛蠚袔覈訸詥謞貈鉌鑉阋隺靍靎靏鞨頜餄餲饸鬩魺鲄鶡鶮鸖鹖麧齃齕龁龢" },
    { "hei", "黑黒嘿嬒潶" },
    { "hen", "很狠恨痕佷哏噷拫艮詪鞎" },
    { "heng", "横恒衡亨哼蘅桁珩佷啈堼姮恆悙橫涥烆狟胻脝訇鑅鴴鵆鸻" },
    { "ho", "乊" },
    { "hol", "乥" },
    { "hong", "红紅虹洪宏烘鸿鴻弘泓轰轟哄讧訌薨訇闳閎荭蕻黉黌仜厷叿吰吽哅唝嗊嚝垬妅娂宖屸巆彋愩揈撔晎汯浤浲渱渹潂澋澒灴焢玒玜瓨硔硡竑竤篊粠紘紭綋纮羾翃翝耾舼苰葒葓謍谹谼谾軣輷鈜鉷銾鋐鍧閧闀闂霐霟鞃鬨魟" },
    { "hou", "后後厚候猴侯喉逅吼齁垕瘊鲎鱟篌堠糇餱骺吽呴帿洉犼睺矦翭翵腄葔豞郈鄇銗鍭鮜鯸鲘" },
    { "hu", "湖呼虎互胡护護糊蝴葫户戶壶壺沪滬瑚琥弧狐忽乎唬扈鹄鵠浒滸鹕鶘醐斛猢冱怙鹱鸌笏戽鹘鶻祜囫烀轷軤瓠煳惚岵滹觳唿槲乕俿冴匢匫喖嗀嗃嘑嘝嚛垀壷姱婟媩嫭嫮寣帍幠弖怘恗戯戱戸抇搰摢擭昈昒曶枑楛楜槴歑殻汩汻沍泘洿淈淲淴濩瀫焀熩瓡瓳礐穫箎箶簄粐絗綔縎縏縠胍膴舗芐芔芴苸萀蔛蔰虍虖虝螜衚觷謼豰鄠鈷鋘錿鍙鍸钴隺雐雽韄頀頶餬鬍魱鯱鰗鱯鳠鳸鴩鶦鶮" },
    { "hua", "话話花化华華画畫划劃滑哗嘩桦樺骅驊猾铧鏵砉侉劐吪埖姡婲婳嫿嬅崋搳摦撶杹椛槬檴澅獪璍畵硴磆粿糀繣腂舙芲蒍蕐蘤蘳螖觟誮諙諣譁譮輠釪釫鋘錵魤鷨黊" },
    { "huai", "坏壞怀懷淮槐徊踝佪咶喟嘳壊懐櫰瀤耲蘹蘾褢褱" },
    { "huan", "换換环環欢歡患缓緩幻焕煥桓寰还還唤喚涣渙奂奐痪瘓浣獾宦豢漶擐逭鲩鯇郇鬟锾鍰圜洹萑缳繯喛嚾圂垸堚孉寏峘嵈巜愌懁懽攌梙槵欥歓汍潅澣澴烉犿狟瑍瓛睆睔瞏瞣糫絙綄羦肒脘荁萈蒝藧螌蠸讙豩豲貆貛輐轘酄鉮鐶镮闤阛雈雚驩鯶鰀鴅鵍鹮鹳鸛" },
    { "huang", "黄黃簧皇潢煌凰晃荒慌谎謊惶蝗磺恍幌隍徨蟥肓篁鳇鰉遑癀湟璜偟兤喤堭塃墴奛媓宺崲巟怳愰揘晄曂朚楻榥櫎汻洸滉炾熀熿爌獚瑝皝皩穔縨艎葟衁詤諻趪鍠鎤鐄锽韹餭騜鱑鷬" },
    { "hui", "回会會灰汇匯惠慧徽辉輝绘繪毁悔荟薈挥揮恢蛔讳諱徊卉烩燴诲誨晖暉茴晦贿賄秽穢浍澮珲琿麾蕙诙詼彗喙恚哕隳蟪洄咴噅虺缋繢佪僡儶叀嘒噕噦嚖囘囬圚壞婎媈孈寭屷幑廆廻廽彙彚徻恛恵憓懳拻撝暳桧椲楎槥橞檅檓檜櫘毀毇沬泋洃湏滙潓濊瀈灳烜烠烣煇煒燬獩璤璯痐瘣眭睢睳瞺禈篲絵翙翚翬翽芔蒐蔧薉藱蘬蘳蚘蛕蜖螝袆褘襘詯譓譭譮譿豗輠违迴逥違銊鏸鐬闠阓隓靧鞼韢頮顪餯鮰鰴鼿齀" },
    { "hun", "混荤葷浑渾婚昏馄餛魂阍閽诨諢溷俒倱圂婫忶惛惽慁掍昬梡梱棔殙涽湣湷焄焝眃睧睯緄緍緡繉绲缗蔒觨轋顐餫鼲" },
    { "huo", "货貨活火获獲伙夥或霍和祸禍豁惑藿谑謔镬鑊耠劐攉锪鍃蠖钬鈥佸俰剨吙咊咟嗀嚄嚿奯姡扮捇掝搉擭旤曤楇檴沎湱漷濊濩瀖灬焃瓠癨眓矆矐礊秮秳穫篧耯腘膕臛艧萿蒦諕謋豰越趏過邩閄隻雘靃騞魊" },
    { "hwa", "夻" },
    { "i", "乁" },
    { "ji", "几幾及即肌技机機鸡雞积積记記级級极極计計季寄纪紀基吉际際剂劑绩績济濟急既集姬激挤擠汲饥饑继繼击擊悸疾玑璣迹跡辑輯忌缉緝寂籍圾箕讥譏畸稽冀脊鲫鯽蓟薊嫉己嵇矶磯暨祭棘妓伎跻躋荠薺羁羈系墼洎鲚鱭屐齑齏戟稷戢虮蟣诘詰笈笄剞叽嘰蒺嵴掎跽霁霽唧畿瘠丌偈芨佶赍齎楫髻咭蕺觊覬麂骥驥殛岌亟犄乩芰哜嚌丮乁亼伋偮僟兾刉刏剤勣卙卟卽厝叝吇呰喞嗘坖垍堲塉墍妀姞姼尐屰岋峜嵆嶯庴廭彐彑彶徛忣惎愱憿懠懻揖揤撃撠攲敧旡旣暩曁枅梞楖槉槣樭橶檕檝檵櫅櫭毄汥泲淁済湒漃漈潗濈瀱焏犱狤猗璂璾畟痵瘵癠癪皀皍睽瞉瞿禝禨秸稘稩穄穊穖穧筓箿簊簎粢糭紒継縘繋繫罽羇耤耭胔脔臠脨膌臮艥艻茍茤莋萁萕葪蒩蔇蕀蕲藉蘄蘎蘮蘻虀蝍螏蟻蟿蠀裚褀襀襋覉覊覘覿觇觌觙觭訐誋諅諔譤讦谻谿賫賷趌趞跂踑踖踦蹐蹟躤躸轚郆鄿銈銡錤鍓鏶鐖鑇鑙隮雦雧霵鞊鞿韲颳飢鬾魝魢魥鮆鯚鯯鰶鰿鱀鱾鳮鵋鶏鶺鷄鷑鸄鹡齌齍" },
    { "jia", "家加假价價佳嘉架甲夹夾驾駕嫁颊頰钾鉀稼贾賈枷荚莢铗鋏葭迦戛浃浹镓鎵痂岬袈恝跏嘏伽胛笳珈瘕郏郟蛱蛺傢叚呷唊圿埉夓婽宊幏徦忦戞扴抸拁拮挈挟挾揩揳擖斚斝梜椵榎榢槚檟毠泇犌猰猳玾筴糘耞脥腵蝦袷裌豭貑跲鉫铪鉿頬颉頡餄饸骱鴶鵊麚" },
    { "jian", "见見件建检檢健键鍵肩箭煎减尖兼剑劍坚堅简簡间間剪歼殲艰艱监監荐薦渐漸鉴鑒践踐捡撿拣揀舰艦溅濺柬笺箋俭儉碱堿槛檻缄緘茧繭饯繭涧澗硷鹼翦贱賤腱戋戔谏諫奸鞯韉牮枧梘趼缣縑搛戬戩踺毽菅鲣鰹笕筧谫譾楗囝蹇裥襇睑瞼謇鹣鶼蒹僭锏鐧湔侟俴倹偂傔僣冿剣剱劎劒劔囏墹姦姧寋帴幵弿彅徤惤挸揃揵擶攕旔暕朁柙栫検椷椾榗樫橌橏橺櫼殲洊涀減湕滥濫瀐瀳瀸瀽熞熸牋犍猏玪珔瑊瑐睷瞯瞷碊磵礀礆礛稴箴篯籈籛糋絸繝纎聻臶茛菺葌葏葥蔪蕑蕳藆虃螹蠒袸襉襺覵覸詃諓謭譼谮譖豜豣賎趝跈轞醎醶釰釼鈃銒銭鋄鋑鋻錬錽鍊鍳鎫鏩鐗鐱鑑鑬鑯鑳钘閒靬鞬韀餞餰馢鬋鰎鰔鰜鳒鳽鵳鹸鹹鹻麉黚黬廴" },
    { "jiang", "将將江奖獎降疆讲講酱醬姜薑蒋蔣浆漿桨槳匠僵绛絳豇礓缰韁犟強耩茳糨洚傋勥匞塂壃夅奨奬嵹弜弶彊摪摾杢橿櫤殭滰畕畺疅糡繮翞膙葁蔃螀螿袶謽醤顜鱂鳉" },
    { "jiao", "叫交角教缴繳胶膠蕉饺餃椒酵窖脚腳娇嬌搅攪骄驕浇澆矫矯郊较較嚼轿轎焦礁姣皎绞絞狡侥僥剿徼校觉覺铰鉸蛟跤艽僬敫峤嶠茭鹪鷦噍醮佼湫鲛鮫挢撟儌劋勦勪呌嘂嘄嘐嘦噭嫶嬓孂峧嵺嶕嶣恔悎憍憢憿挍捁摷撹敎敥敽敿斠晈暞曒樔橋櫵湬滘漖潐灂灚烄焳煍燋獥珓璬皦皭稾穚窌笅筊簥纐膲臫芁茮菽蕎藠虠蟜蟭覐覚訆譑譥賋趫趭踋蹻轇鄗釂釥鐎骹鱎鵁鵤鷮纟" },
    { "jie", "接节節街借皆界洁潔杰傑捷婕结結届屆姐截解戒睫介阶階芥竭疥揭秸诫誡劫桀颉頡羯诘詰碣偈嗟藉喈拮骱蚧鲒鮚讦訐孑疖癤丯倢偼刦刧刼劼卪吤唶啑嚌堦堺契妎媎媘媫嫅尐岊岕崨嵑嵥嶰嶻巀幯庎徣忦悈扢掲搩擑擮擳斺昅曁桝椄楐楬楶概榤構檞櫭毑洯渇湝滐煯犗狤獬玠琾畍疌痎砎砝礍稭紒絜繲耤脻艐莭菨蓵蛣蛶蜐蝍蝔蠘蠞蠽衱衸袓袷袺裓褯觧誱謯趌跲踕迼鉣鍻锴鍇雃鞂鞊飷髫魝魪鶛卩" },
    { "jin", "进進近今仅僅紧緊金斤劲勁禁锦錦筋津巾晋晉瑾槿尽盡浸谨謹襟靳衿矜嫤噤缙縉觐覲烬燼堇廑馑饉妗荩藎卺赆贐伒侭僸儘兓凚劤厪唫嚍埐堻墐壗婜嬐嬧寖嶜巹惍慬搢斳枃榗歏殣浕溍漌濅濜煡珒琎琻瑨璡璶砛祲竻笒紟紾臸荕菫菳蓳觔訡賮釒釿钅锓鋟馸鹶黅齽" },
    { "jing", "竟京净淨精晶境景敬静靜井惊驚经經镜鏡警竞競荆鲸鯨颈頸径徑兢茎莖睛劲勁痉痙靖腈旌婧泾涇粳璟肼獍阱弪弳刭剄憬胫脛菁儆迳逕丼亰仱俓倞傹儬凈劤坓坕坙妌婙婛宑巠幜憼擏旍暻曔桱梷橸檠殑汫汬浄濪瀞烃烴燝猄獷璄璥秔稉穽竧竫竸箐粇経聙荊葝蟼誩踁鋞陉陘靑靘頚頴颕鵛鶁鶄麖麠鼱" },
    { "jiong", "窘炯炅迥扃侰僒冂冋冏囧坰垧埛宭扄昋泂浻澃瀅烱煚煛熒熲燑燛絅綗臦臩蘏蘔褧逈銄鎣顈颎駉駫" },
    { "jiu", "就九玖酒旧舊久救韭灸纠糾舅究揪臼咎疚赳鹫鷲鸠鳩阄鬮韮蹴僦啾厩廄柩桕鬏丩乆乣倃剹勼匓匛匶噍奺廏廐慦捄揂揫摎朻杦柾樛橚殧氿汣湫湬牞畂稵穋窌糺紤缪繆舏萛蝤镹鯦麔齨" },
    { "jou", "欍" },
    { "ju", "句巨局具居桔橘聚菊举舉距锯鋸剧劇据據炬矩拘拒惧懼鞠踞驹駒钜飓颶俱榉櫸沮狙咀疽倨醵裾屦屨犋苴窭锔鋦椐苣琚掬榘龃齟趄莒雎遽踽鞫讵詎伡侷俥倶僪冣凥勮匊圧坥埧埾壉姖娵婅婮寠岠岨崌巈弆忂怇怐怚愳懅抅拠拱挙挶捄揈揟擧昛梮椇椈檋欅歫毩毱泃泦洰涺淗湨澽焗焣爠犑狊珇痀眗瞿砠秬窶筥篓簍簴籧粔粷罝耟聥腒臄艍菹萭葅蒌蔞蒟蒩蓻蘜蘧處虡蚷蜛螶袓襷諊豦貗趉趜趡跔跙跼踘蹫蹻躆躹軥輂邭郥郰郹鄹鉅鉏鋤鐻锄閰陱駏駶驧鬻鮈鮍鮔鲏鴡鵙鵴鶋鶪鼰鼳" },
    { "juan", "卷鹃鵑捐娟眷绢絹涓倦劵镌鐫隽雋狷圈锩錈悁蠲桊棬鄄勌勬呟圏埍埢奆姢嶲巂帣弮惓慻捲擐朘梋泫淃焆獧瓹睃睊睠絭縳罥羂脧腃臇菤萒蔨蕋蜷裐襈讂踡鋑鋗鎸闂雟鞙韏飬餋鵍" },
    { "jue", "决決绝絶絕觉覺爵掘诀訣崛倔抉嚼蕨攫厥撅阙獗桷噱橛觖爝矍镢钁角劂珏噘谲譎蹶孓亅傕刔勪匷叏吷啳埆壆夬妜孒屩屫崫嶡嶥弡彏憠憰戄挗捔撧斍柽檉橜欔欮殌氒泬潏灍焆焳熦燋爑爴玃玦玨瑴璚疦瘚矞矡砄穱繑繘臄芵蕝蕞虳蚗蟨蟩蠼袦覐覚觼誳貜赽趉趹蹷蹻躩逫鈌鐍鐝镼闋阕闕鞒鞽駃騤骙髉鱖鳜鴂鴃鶌鷢龣" },
    { "jun", "军軍君均菌俊峻竣骏駿钧鈞浚郡筠隽雋皲皸濬儁麇捃呁埈姰寯懏攈晙桾汮焌焞燇釨畯皹碅箘箟莙葰蔨蚐蜠袀覠訇銁銞鋆鍕陖餕馂鮶鲪鵔鵕鵘麏麕" },
    { "ka", "卡喀咖胩咔哢佧呿垰珈衉裃鉲咯" },
    { "kai", "开開凯凱慨楷铠鎧忾愾揩锴鍇恺愷垲塏闿剀剴锎鉲蒈勓喫嘅噄奒嵦幆愒暟欬欯溘濭炌炏烗衉豈輆鎎鐦闓颽" },
    { "kal", "乫" },
    { "kan", "看砍堪刊坎槛檻勘瞰阚闞侃碪磡冚崁龛龕戡莰偘凵埳堿塪墈嵁惂扻栞欿歁監矙竷莶薟衎譼輡輱轁轗靬顑" },
    { "kang", "抗炕扛康糠慷亢伉钪鈧嫝槺闶閌匟囥嵻忼摃漮犺砊穅粇躿邟鏮阬骯鱇" },
    { "kao", "靠考烤拷犒铐銬栲尻嵪熇彀攷洘焅燺薧訄髛鮳鯌鲓丂" },
    { "ke", "可克科颗顆刻课課棵客壳殼渴咳柯氪轲軻磕珂苛恪稞蝌喀坷嗑瞌岢缂緙蚵窠钶鈳颏頦锞錁髁疴屙溘骒騍剋勀勊匼堁娔尅峇嵑嵙嶱悈愘愙揢搕敤榼樖欬歁殻毼渇濭炣牁犐痾盍砢硞碦磆礊礚窼簻翗胢艐萪薖衉袔趷醘鉿铪龕" },
    { "kei", "剋勀勊尅" },
    { "ken", "肯啃恳懇垦墾裉掯珢硍肎肻褃豤貇錹頎颀" },
    { "keng", "坑吭铿鏗劥坈妔奟挳揁摼殸牼硁硍硎硜硻誙踁銵鍞阬" },
    { "ki", "怾" },
    { "kong", "空孔控恐倥崆箜埪宆悾椌涳矼硿羫躻錓鞚鵼" },
    { "kos", "廤" },
    { "kou", "口扣抠摳寇蔻叩芤眍瞘筘冦剾劶宼彄怐敂毆溝滱眗瞉窛竘簆茠蔲釦鏂鷇" },
    { "ku", "库庫苦枯裤褲酷哭窟绔絝骷刳喾嚳堀俈圐崫扝捁搰朏桍楛泏焅狜瘔矻硞秙窋胐袴趶跍郀鮬" },
    { "kua", "夸誇跨挎胯侉垮咵姱恗晇楇絓舿華蕐袔銙顝骻髁" },
    { "kuai", "快块塊筷会會蒯脍膾侩儈哙噲浍澮郐鄶狯獪凷圦墤巜廥擓旝璯糩蒉蕢駃鬠鱠鲙" },
    { "kuan", "宽寬款髋髖寛梡欵歀窽窾鑧" },
    { "kuang", "矿礦筐框况況旷曠匡狂眶哐邝鄺诳誑纩纊诓誆圹壙夼贶貺丱儣劻匩卝岲忹恇懬懭抂昿洭爌狅眖矌砿硄穬筺絋絖軖軠軦軭迋邼鉱鋛鑛鵟黋" },
    { "kui", "亏虧愧奎窥窺葵魁馈饋盔岿巋揆睽跬聩聵馗蝰逵夔傀溃潰愦憒篑簣喹暌匮匱蒉蕢蘷虁悝喟隗刲卼嘳媿嬇尯巙戣晆楏楑樻櫆欳殨煃瞶磈籄聧聭胿腃膭蒍藈蘬觖謉蹞躨鄈鍨鍷鐀鑎闚阕闋頄頍頯顝餽騤骙" },
    { "kun", "捆困昆坤鲲鯤锟錕髡琨醌阃閫悃堃堒壸壼婫尡崐崑晜梱涃潉焜熴猑瑻睏硱祵稇稛綑罤臗菎蜫裈裍裩褌豤貇閸騉髠髨鰥鳏鵾鶤鹍" },
    { "kuo", "阔闊扩擴廓括蛞栝噋懖拡挄桰漷濶燭爥秳筈萿葀霩鞟鞹韕頢髺鬠" },
    { "kweok", "穒" },
    { "kwi", "櫷" },
    { "la", "拉啦辣腊臘蜡蠟垃瘌邋喇砬剌旯落儠嚹揦揧搚摺擸攋柆楋櫴溂爉瓎磖翋臈菈藞蝋蝲辢鑞镴鞡鬎鯻鱲" },
    { "lai", "来來莱萊籁籟睐睞癞癩濑瀨崃崍涞淶铼徕徠赖賴赉賚俫倈勑厲唻娕婡庲懶攋梾棶櫴淶瀬猍琜筙箂藾襰誺逨郲釐錸頼顂騋鯠鵣鶆麳黧" },
    { "lan", "蓝藍兰蘭篮籃览覽栏欄缆纜揽攬榄欖岚嵐阑闌澜瀾拦攔葻烂爛滥濫谰讕婪懒懶褴襤斓斕镧鑭罱漤濫僋儖厱嚂囒坔壈壏嬾孄孏幱惏懢擥暕欗浨湅灆灠灡燗燣爁爤爦璼瓓礷籣糷繿蘫襕襴襽覧譋躝醂钄韊顲" },
    { "lang", "朗浪狼郎榔廊琅螂稂莨啷锒鋃阆閬蒗俍勆哴唥埌塱嫏崀悢朖朤桹樃樠欴烺瑯硠筤脼艆蓈蓢蜋誏踉躴郒郞鎯駺" },
    { "lao", "老牢劳勞烙酪佬捞撈涝澇姥崂嶗唠嘮痨癆醪嫪耢耮铹鐒铑銠栳僗労咾哰嗠嘐恅憥憦朥橯浶狫珯硓磱窂簩粩荖蓼蛯蟧軂轑顟髝鮱" },
    { "le", "乐樂了勒玏楽饹餎仂叻泐嘞忇扐氻牞砳竻簕艻阞韷鳓鰳" },
    { "lei", "类類雷磊蕾镭鐳累泪淚擂肋垒壘耒勒儡缧縲羸诔誄酹嫘檑嘞傫儽厽塁壨攂樏櫐櫑欙洡涙漯灅瓃畾瘣癗矋磥礌礧礨祱禷絫纇纍纝罍脷蔂蕌藟蘱蘲蘽虆蠝讄轠郲銇錑鑘鑸靁頛頪颣鱩鸓鼺" },
    { "leng", "冷棱愣崚楞稜㘄塄唥碐薐䉄䬋堎倰睖踜䚏䮚" },
    { "li", "力立李理利梨礼禮丽麗莉粒黎锂鋰璃里裏裡历曆离離例荔厉厲厘隶隸雳靂励勵沥瀝栗鲤鯉犁篱籬郦酈笠蛎蠣蜊骊驪俪儷砺礪栎櫟莅蒞吏漓鹂鸝俐痢傈狸砾礫坜壢哩苈藶鳢鱧缡縭跞躒悝澧粝糲蓠蘺枥櫪蠡鬲呖嚦嫠篥疠癘疬鬁猁藜溧鲡鱺戾唳醴轹轢詈罹逦邐喱黧俚娌仂儮凓刕剓剺劙厤厯叓叕叻唎嚟囄囇塛娳婯孋孷屴岦峛峲巁廲悡悧悷慄扐扚捩搮擽攊攦攭斄暦曞朸柂栃栛栵梸棃棙樆檪櫔欐欚歴歷氂沴沵浬涖淚濼濿灑灕爄爏犂犛犡珕珞琍瑮瓅瓈瓑瓥癧皪盠盭睝矖砅砬硌磿礰禲秝穲竰筣粚粴糎綟纅纚翮脷艃苙茘荲菞蒚蔾蚸蛠蜧蝕蝷蟍蟸蠇蠫褵觻謧讈豊貍赲轣邌醨釃釐鉝銐鋫錅錑鎘鏫鑗铄鑠镉隷靋鬴鯏鯬鱱鱳鳨鴗鵹鷅麜" },
    { "lia", "俩倆" },
    { "lian", "连連联聯莲蓮恋戀脸臉怜憐帘簾炼煉练練链鏈敛斂廉镰鐮涟漣琏璉鲢鰱殓殮蠊蔹蘞奁奩潋瀲臁裢褳濂裣襝楝亷僆劆匲匳嗹噒堜娈孌媡嫾嬚慩搛摙撿梿槏槤櫣欄歛浰湅溓澰濓熑燫瑓瞵磏稴籢籨縺纞羷羸翴聨聫聮膦莶萰薕薟蘝螊覝謰譧蹥鄻醶錬鍊鎌镧鬑鰊鱄" },
    { "liang", "量两兩亮良凉粮糧梁晾靓辆輛谅諒俩倆粱墚踉椋魉莨両俍倞哴唡啢喨悢掚樑涼湸煷簗綡緉脼蜋蜽裲蹒蹣輌輬辌鍄閬阆靚駺魎冫" },
    { "liao", "料聊疗療廖辽遼燎撂撩僚了镣鐐潦缭繚獠嘹寥钌釕蓼尥寮鹩鷯嫽尞尦屪嵺嶚嶛廫憀憭摎敹暸樛漻炓爎爒璙瞭窷竂簝膋膫蟉蟟蟧豂賿蹘蹽轑鄝鏐镠镽飂飉髎" },
    { "lie", "列裂猎獵劣烈咧埒捩鬣趔躐冽洌儠劦劽哷埓奊姴峢巁巤忚挒挘擸棙櫑毟浖烮煭燤爄爉犣猟睙綟聗脟臘茢蛚迾邋颲鬛鮤鱲鴷" },
    { "lin", "林临臨邻鄰赁賃琳霖淋拎麟吝蔺藺啉磷鳞鱗凛凜遴嶙粼躏躪辚轔廪廩懔懍瞵檩檁膦亃伈僯厸壣崊恡悋惏撛斴晽暽橉涁潾澟瀶焛燐獜玪璘甐疄痳癛癝碄稟箖粦繗翷菻蹸躙轥鏻閵隣顲驎魿麐" },
    { "ling", "另令领領零铃鈴玲岭嶺龄齡凌淩灵靈陵菱瀮绫綾伶羚棱翎聆蛉苓瓴呤泠棂欞柃酃鲮鯪囹倰刢坽夌姈婈孁岺崚彾掕昤朎櫺澪炩燯爧狑琌皊砱祾秢竛笭紷舲蓤蔆蕶蘦衑袊裬詅跉軨輘醽錂閝阾霊霗霛霝靇駖魿鴒鸰鹷麢齢龗" },
    { "liu", "六流留刘劉柳硫浏瀏榴琉溜瘤馏餾绺綹鎏镏鎦骝騮锍鋶旒鹨鷚熘遛嚠塯媹嬼嵧廇懰斿旈栁桞桺橊橮沠泖漻澑熮珋瑠瑬璢畂畄畱疁癅磂磟罶羀翏膢蒌蔞蒥蓅蓼藰蟉裗蹓鏐鐂镠雡霤飀飂飅飗駠駵驑鬸鰡鶹鹠麍" },
    { "lo", "咯囖" },
    { "long", "龙龍拢攏笼籠隆聋聾咙嚨陇隴珑瓏垄壟窿垅壟胧朧茏蘢泷瀧栊櫳癃砻礱儱厐哢壠屸嶐巃巄徿昽曨梇槞湰滝漋爖眬矓硦礲竉竜篢篭蕯蝕蠪蠬衖襱谾豅贚躘鏧鑨霳靇驡鸗龒龓" },
    { "lou", "楼樓搂摟漏陋娄婁篓簍镂鏤偻僂蝼螻蒌蔞髅髏喽嘍嵝嶁瘘瘺耧耬塿寠屚廔慺溇漊熡甊瘻瞜窶膢艛謱軁遱鞻" },
    { "lu", "路露录錄陆陸璐鹿潞卢盧鲁魯卤鹵芦蘆庐廬鹭鷺麓炉爐颅顱禄祿鲈鱸泸瀘碌轳轤辂輅辘轆撸擼掳擄虏虜赂賂戮栌櫨橹櫓六渌淥蓼逯氇氌簏垆壚胪臚噜嚕镥鑥漉鸬鸕舻艫侓僇剹勎勠嗠嚧圥坴塶塷娽峍廘彔挔捛摅攄摝攎枦椂樐樚淕滷漊澛瀂熝獹玈琭璷瓐甪瘳盝睩矑硉硵磠稑穋箓簬簵簶籙籚粶緑纑罏翏膔膟舮艣艪菉蓾蔍蕗虂螰蠦觮觻趢踛蹗鄜醁鈩録錴鏀鏕鏴鐪鑪騄騼髗魲鯥鱳鴼鵦鵱黸" },
    { "luan", "乱亂卵峦巒孪孿挛攣栾欒銮鑾鸾鸞滦灤脔臠娈孌乿圝圞奱曫灓癴癵羉脟臡薍虊覶釠鵉" },
    { "lue", "略掠锊鋝剠圙寽擽畧稤詻鋢" },
    { "lun", "论論轮輪伦倫仑侖抡掄纶綸沦淪囵圇埨婨崘崙惀棆溣睔碖磮稐耣腀菕蜦踚錀陯鯩" },
    { "luo", "落罗羅锣鑼裸萝蘿洛逻邏络絡螺骆駱珞箩籮铬鉻骡騾烙咯荦犖漯蠃雒倮硌椤欏脶腡瘰摞泺濼镙鏍猡玀儸儽剆啰囉峈挼捰攎攞攭曪橐櫟欙猓癳皪砢硦礫笿羅纙臝茖蓏蛒蜾蝸蠡袼覶覼詻跞躒躶鎯頱饠驘鮥鱳鵅鸁" },
    { "lv", "绿綠緑铝鋁旅滤濾吕呂律侣侶虑慮驴驢氯缕縷履屡屢榈櫚闾閭捋褛褸偻僂率膂稆穭儢勴卛哷垏壘寠寽嵂慺曥梠樓櫖櫨氀焒爈瘻瞜祣穞箻絽繂膐膢葎藘謱軁郘録鑢馿鷜" },
    { "m", "呒嘸呣" },
    { "ma", "吗嗎妈媽马馬码碼麻玛瑪蚂螞抹嘛蔴骂罵駡蟆嬷嫲嬤犸獁杩榪亇傌孖尛溤犘痲睰礣祃禡蟇貉貊遤鎷閁鬕鰢鷌麽" },
    { "mai", "买買卖賣迈邁麦麥脉脈唛嘜劢勱霾埋売荬蕒佅嘪薶衇貍霡霢鷶" },
    { "man", "满滿慢漫蔓曼馒饅螨蟎蛮蠻幔鳗鰻缦縵瞒瞞谩謾墁镘鏝颟顢鞔熳僈姏嫚屘悗慲摱槾樠満澫澷獌睌矕絻蔄蘰蟃襔蹒蹣鄤鏋鬗鬘" },
    { "mang", "忙芒盲莽茫氓硭邙蟒漭厖吂哤壾娏尨庬恾朚杗杧汒浝牤牻狵甿痝盳瞢硥笀茻莾蘉蛖蠎釯鋩铓駹鸏鹲龒" },
    { "mao", "毛冒帽猫貓贸貿茂貌茅铆鉚矛卯牦犛锚錨袤茆瑁蝥髦懋耄昴瞀峁蟊旄泖侔冃冇冐勖務堥夘媢嵍愗戼暓枆楙毣毷氂渵獏皃眊秏笷緢罞芼萺蓩蛑蝐覒貇軞鄚鄮酕鉾霿髳鶜" },
    { "me", "么麼嚒嚜嚰孭庅濹癦麽" },
    { "mei", "没沒每煤美妹枚玫眉梅媒莓媚魅嵋酶镁鎂霉黴寐昧媄猸袂湄浼鹛镅鋂楣凂呅嚜坆坶堳塺媺嬍嵄徾抺挴攗攟栂楳槑櫗毎氼沬渼湈溦煝燘珻瑂痗眊眛睂睸矀祙禖篃羙脄脢腜膴苺葿蘪蝞跊躾郿鎇韎鬽鶥黣" },
    { "men", "门門们們闷悶焖燜扪捫钔鍆懑懣亹怋悗惛暪椚殙汶満玟玣玧璊瞞穈菛虋閅鞔" },
    { "meng", "梦夢蒙孟盟檬萌朦猛锰錳濛蜢勐懵礞甍蠓虻艋艨瞢氓儚冡夣嫇尨幪庬懜懞掹擝曚橗氋溕獴瓾甿矇矒罞莔萠蕄蝱蟊鄳鄸鋂雺霚霥霧霿靀顭饛髳鯍鯭鱦鸏鹲黽黾鼆" },
    { "meo", "踎" },
    { "mi", "米密迷蜜谜謎秘弥彌幂冪觅覓靡糜泌眯醚櫁咪汨麋祢禰宓猕獼谧謐弭蘼縻芈脒敉嘧糸侎冖冞劘哋塓孊宻尒尓峚幎幦戂摵擟擵攠榓樒檷沕沵洣淧渳溟滵漞濔濗瀰灖熐爢獯瓕眫眽瞇瞴祕穈簚籋粎罙羃羋葞蒾蓂蔝蔤藌蝆袮覔覛詸醾醿釄銤鑖镾鸍麊麛鼏" },
    { "mian", "面麵棉免绵綿眠勉缅緬冕娩腼靦湎靣麪麫麺眄沔黾黽渑澠丏俛偭勔厸喕婂媔嬵愐檰櫋汅湣牑矈矊矏糆絻緍緜緡缗臱芇莬葂蝒蠠鮸宀" },
    { "miao", "秒苗妙描淼喵渺邈瞄庙廟眇缪繆藐缈緲杪鹋鶓仯媌嫹庿彯玅竗篎緢蜱訬鱙" },
    { "mie", "灭滅蔑咩篾蠛乜吀哶孭幭懱搣櫗瀎眜薎衊覕谂諗鑖鱴鴓" },
    { "min", "民敏闽閩闵閔皿悯憫抿泯忞旻珉瑉愍湣缗緡岷玟苠黾黽鳘鰵僶冧冺刡勄呡垊姄崏怋慜捪敃敯旼暋渂湏潣琘琝痻盷盿砇碈笢笽簢緍罠蠠賯鈱錉鍲鴖" },
    { "ming", "名明命鸣鳴茗铭銘佲螟冥瞑暝溟酩凕姳嫇慏掵朙榠洺猽眀眳蓂覭詺鄍" },
    { "miu", "谬謬缪繆" },
    { "mo", "磨末膜墨默魔模摩漠陌蘑沫茉摸抹莫寞馍饃摹秣么麼嬷殁歿镆鏌嫫谟謨蓦驀瘼貊貘麽耱劘劰嗼嚤嚩圽塻嫼尛帓帞怽懡戂擵攠昩暯枺橅歾瀎爅狢皌眜眽眿瞐瞙砞礳粖糢絈絔縸纆艒莈藐藦蛨蟆蟔袹謩譕貃貈貉銆靺鞨饝髍魩魹麿黙" },
    { "mou", "某谋謀牟眸蛑鍪侔哞劺厶呣堥婺恈敄桙毋洠瞴蟱袤鉾鞪鴾麰蝥" },
    { "mu", "木母目沐牡牧慕睦幕募穆暮亩畝模拇姆墓钼鉬牟毪坶仫苜凩墲娒峔幙慔朷楘樢毣氁炑牳狇獏畆畒畞畮砪縸繆缪胟艒茻莯萺蚞踇鉧雮霂鞪呒嘸" },
    { "myeo", "旀" },
    { "myeon", "丆" },
    { "myeong", "椧" },
    { "n", "嗯咹哏" },
    { "na", "那拿哪纳納娜钠鈉呐衲捺镎錼肭乸吶呶嗱妠抐拏挐淰秅笚笝箬篛蒘蒳袦訤詉誽豽貀蹃軜郍鎿雫靹魶" },
    { "nai", "乃耐奶奈氖萘艿柰鼐佴倷嬭孻廼掜搱摨渿熋疓耏腉螚褦迺釢錼" },
    { "nan", "难難南男楠腩喃囡萳蝻侽赧囝妠娚婻嫨弇戁抩揇暔枏枬柟湳煵畘莮諵遖" },
    { "nang", "囊馕饢曩囔攮乪儾嚢崀憹搑擃欜涳瀼灢蘘蠰譨鬞齉" },
    { "nao", "闹鬧脑腦挠撓瑙恼惱孬垴堖悩閙铙鐃淖呶蛲蟯猱硇匘夒婥嫐峱嶩巎巙怓憹橈檂獶獿碙碯脳腝臑蝚詉譊" },
    { "ne", "呢哪那呐讷訥吶抐疔眲疒" },
    { "nei", "内馁餒那哪內娞婑氝浽脮腇錗餧鮾鯘" },
    { "nem", "焾" },
    { "nen", "嫩恁嫰媆枘腝臑" },
    { "neng", "能竜而耐螚" },
    { "neus", "莻" },
    { "ng", "嗯" },
    { "ngag", "鈪" },
    { "ngai", "銰" },
    { "ngam", "啱" },
    { "ni", "你妳泥拟擬逆倪尼妮霓昵匿腻膩溺呢铌鈮坭猊伲怩鲵鯢睨旎伱儗儞児兒埿堄婗嫟嬭嬺孨孴屔屰嶷彌惄愵慝懝抐抳掜晲暱柅棿檷氼淣滠濔濘瀰灄狔痆眤秜籾縌聻胒腝臡苨薿蚭蛪蜺袮觬誽譺貎跜輗迡郳鉨鑈镾隬馜麑齯" },
    { "nian", "年念粘黏捻撚拈碾撵攆蔫廿辇輦鲇鲶鯰辗輾埝墊卄哖唸姩捵榐涊淰溓痆秊秥簐艌趂跈蹍蹨躎鮎鵇" },
    { "niang", "娘酿釀嬢孃醸䖆" },
    { "niao", "鸟鳥尿袅裊嫋茑蔦嬝脲嬲尥尦樢溺茮褭" },
    { "nie", "捏镍鎳聂聶涅镊鑷啮嚙齧孽蹑躡臬陧隉蘖嗫囁颞顳乜喦噛囐囓囡圼埝墊孼峊嵒嵲嶭巕帇惗掜揑摂摰敜枿棿槷櫱痆篞籋糱糵肀臲苶菍蠥褹諗讘踂踗踙鉨鉩銸鋷錜鑈钀闑" },
    { "nin", "您恁囜拰脌" },
    { "ning", "宁寧凝柠檸拧擰泞咛嚀濘狞獰甯聍聹佞侫儜嬣寍寕寗寜橣澝矃苧薴鑏鬡鬤鸋" },
    { "niu", "牛扭纽紐钮鈕妞拗狃忸怓抝杻汼沑炄牜莥蚴靵" },
    { "nong", "弄浓濃农農脓膿侬儂哝噥秾穠憹挊挵欁癑禯繷莀蕽襛辳醲齈廾" },
    { "nou", "耨啂嬬搙擩槈檽獳羺譨譳鎒鐞" },
    { "nu", "怒努奴孥驽駑弩胬伖伮傉呶帑搙擩砮笯褥詉" },
    { "nuan", "暖煖奻渜湪濡煗餪" },
    { "nue", "虐疟瘧谑謔硸" },
    { "nun", "黁" },
    { "nung", "燶" },
    { "nuo", "挪诺諾喏糯懦娜傩儺锘鍩搦哪堧媠嫷愞懧掉掿搙搻梛榒橠毭渪稬穤糑糥耎袲袳蹃逽那郍" },
    { "nv", "女钕釹籹衄恧朒沑狃聏肭衂" },
    { "nve", "婩疟瘧虐" },
    { "o", "哦喔噢筽" },
    { "oes", "夞" },
    { "ol", "乯" },
    { "on", "昷鞰" },
    { "ou", "偶欧歐藕鸥鷗耦讴謳呕嘔瓯甌殴毆怄慪沤漚区區吘吽塸敺櫙渥澫熰纡紆腢膒蓲蕅藲醧鏂鴎齵" },
    { "pa", "怕爬趴啪帕琶杷筢葩耙扒妑帊掱汃潖皅舥苩袙跁钯鈀" },
    { "pai", "派排拍牌湃徘哌迫俳蒎棑椑犤猅箄簰腗輫鎃" },
    { "pak", "磗" },
    { "pan", "盘盤盼判攀畔潘磐番蟠叛襻袢泮蹒蹣湴溿拚爿乑冸坢媻宷幋弁搫柈槃沜洀瀊瀋炍牉牓畨皤盻眅眫碆磻籓縏膰蒰螌褩詊跘踫鄱鋬鎜鑻闆鞶頖鵥" },
    { "pang", "旁胖庞龐乓膀磅滂彷耪逄螃仿傍厐嗙夆嫎尨徬房汸沗炐篣肨胮膖舽蒡蠭覫趽雱霶髈鰟鳑龎" },
    { "pao", "跑抛炮泡刨袍咆庖狍疱砲皰麅匏脬嚗垉奅拋摽炰爮犥瓟礟礮穮窌脟萢藨蚫袌褜謈軳鉋铇鞄飑颮麃麭" },
    { "pei", "陪配赔賠佩沛裴培姵珮胚呸旆锫錇帔醅霈辔轡伂俖垺妚婄媐嶏怌抷掊攈斾昢柸棑毰浿淠犻琣琲笩肧艴茇茷蓜衃裵阫陫馷駍" },
    { "pen", "喷噴盆湓呠喯歕濆瓫翉翸葐衯" },
    { "peng", "碰捧棚蓬朋彭鹏鵬烹膨篷硼砰抨澎怦竼芃堋蟛嘭倗傰剻匉塜塳弸恲憉挷掽搒摓梈椖椪槰樥泙淎淜滂漨漰熢痭皏硑磞稝篣絣纄胓荓莑蟚踫軯軿輣輧逬錋鑝閛韸韼駍騯髼鬅鬔" },
    { "peol", "浌" },
    { "phas", "巼" },
    { "phdeng", "闏" },
    { "phoi", "乶" },
    { "phos", "喸" },
    { "pi", "批皮披匹疲啤琵枇霹坯陂劈辟邳屁脾僻痞纰紕毗譬砒貔丕媲癖否圮仳擗郫甓睥蜱鼙吡铍鈹庀罴羆埤陴淠噼蚍裨伓伾俾噽嚊嚭壀妚嫓岯崥嶏帔庳怶悂憵抷拂揊旇朇枈椑榌毘毞渒潎澼濞炋焷狉狓猈疈疋痦痺睤磇礔礕秛秠稫笓箆篦篺簲粃罷翍耚肶脴腗膍芘苉苤萆蕃蚽蚾螕螷蠯被諀豼豾鄱釽鈚鈲鉟銔銢錃錍鎞钚鈈闢阰隦鞞顖駓髬魮魾鮍鲏鴄鵧鷿鸊" },
    { "pian", "片篇骗騙偏翩缏緶骈駢犏胼蹁谝諞囨媥徧楄楩猵璸腁萹蝙褊覑諚貵賆跰騈騗骿魸鶣" },
    { "piao", "票漂瓢飘飄朴樸莩骠驃剽嫖瞟殍螵缥縹嘌僄勡彯徱慓摽旚潎犥皫磦篻翲膘蔈薸謤醥闝顠飃骉驫魒髟" },
    { "pie", "瞥撇氕苤嫳撆暼潎覕鐅丿" },
    { "pin", "品拼频頻贫貧聘嫔嬪娉颦顰姘榀牝嚬拚朩汖玭琕矉砏礗穦薲蘋馪驞" },
    { "ping", "平萍苹蘋瓶屏凭憑评評乒坪娉枰鲆鮃俜倗凴呯塀娦屛岼帡帲幈慿檘泙洴涄淜焩玶甁甹砯硑竮箳簈缾聠胓艵荓蓱蚲蛢軿輧郱鉼頩冖秤" },
    { "po", "破坡婆泼潑泊魄鄱珀颇頗迫粕笸皤钋釙陂攴叵钷鉕哱嘙奤娝尀尃屰岥岶廹搫敀昢桲椺櫇洦淿湐溌烞猼皛砶翍膊蒪蔢謈酦醱鏺霸馞駊髆泺濼" },
    { "pou", "剖掊裒吥咅哣垺堷婄抔抙捊棓涪犃箁裦襃踣郶锫錇颒" },
    { "ppun", "兺哛" },
    { "pu", "普葡铺鋪谱譜脯蒲莆浦菩瀑埔圃匍溥扑撲仆僕曝濮镨鐠噗朴樸蹼璞苻镤鏷氆堡圑圤墣巬巭抪捗擈攴暜柨檏潽炇烳獛痡瞨砲秿穙箁纀舖舗荹菐蒱蜅襆襥諩豧贌酺陠駇鯆鵏攵" },
    { "q", "瑁" },
    { "qi", "期起七柒气氣齐齊器汽奇漆启啟企旗棋骑騎麒其琦祺琪绮綺杞崎岂豈砌骐騏弃棄欺戚泣祁凄淒淇乞契祈栖棲脐臍荠薺歧迄沏讫訖岐蹊萁蕲蘄憩稽頎屺畦颀桤榿芪萋芑汔亟鳍鰭俟槭嘁蛴蠐綦亓欹蜞圻葺碛磧祗耆丌亝倛偈傶僛剘呇呮咠唘唭啓啔喰噐埼夡娸婍岓嵜帺忔忮忯恓恝悽愒愭慼慽憇懠扢扱扺技拞挈捿掑摖攲敧斉斊旂晵暣朞栔桼梩棊棨檱櫀欫毄気洓済渏湆湇滊濝炁焏猉玂玘璂甈畸疧盀盵矵碁碕碶磎磜磩礘祇禥禨稘竒簯簱籏粸紪絜綥綨綮緀緕纃缼罊肐肵舙艩芞萕藄蚑蚔蚚蜝螇螧蟣蟿衹袳裿褀褄觭諆諬諿趞趿跂踑踖踦躤躩軙軝迉邔郪鄿釮錡鏚鐖锜闙隑霋饑騹鬐鬾鬿魌魕鮨鯕鲯鵸鶀鶈麡鼜齮" },
    { "qia", "恰掐洽卡髂袷葜佉價冾咭圶帢愘抲拤挈揢搳擖楬殎矻硈磍跒酠鞐鲒鮚" },
    { "qian", "前钱錢千仟签簽黔倩纤纖乾欠茜蒨芊阡遣牵牽迁遷铅鉛浅淺谦謙潜潛钳鉗歉谴譴嵌扦堑塹芡骞騫钎釺扡岍钤鈐褰箝掮搴慊悭慳愆虔荨蕁缱繾佥僉肷膁椠槧犍乹仱伣俔偂傔儙凵刋厱唊嗛圱圲墘壍奷婜媊嬱孅孯岒嵰廞忴悓扲拑拪挳掔揃揵摼撁撍撖攐攑攓朁杄杴棈榩槏橬檶櫏欦欿歁歬汘汧涔湔濳濽灊灒炶煔熑燂燫皘竏箞篏篟籖籤粁綪縴羬脥腱臤艌苂茾荕葥葴蔳藖蚈蚙蜸諐谸軡輤鈆鉆銭鋟錎鍼鎆鏲鐱鑓鑯锓開雃靬韆顅馯騚騝鬜鬝鰜鰬鳒鳽鵮鶼鹐鹣黚" },
    { "qiang", "强強枪槍墙墻牆抢搶腔蔷薔呛嗆锵鏘跄蹌戗戧襁繈樯檣镪鏹戕炝熗锖錆羌蜣羟羥嫱嬙創勥哐唴啌嗴墏嶈廧彊摤摪斨椌殻溬漒爿牄猐獇玱琷瑲矼箐篬繦羗羫羻艢蔃蘠親謒跫蹡鎗顩鶬鸧" },
    { "qiao", "桥橋俏乔喬侨僑敲巧翘翹锹鍬瞧鞘撬悄窍竅峭橇樵荞蕎跷蹺硗磽憔谯譙壳殼鞒鞽愀缲繰诮誚劁偢僺勪喿嘺噭塙墝墧墽嫶峤嵪嶠帩幓幧摮撽敫槗橾毃毳潐焳燆燋犞癄睄硚碻磝礄礉窯箾繑荍菬藮蟜譑趫趬踃踍蹻躈郻鄗鄡鄥醮釥銚鍫鏒鐈鐰铫陗鞩韒頝顤顦骹髚髜" },
    { "qie", "切且茄怯窃竊妾趄惬愜锲鍥箧篋砌郄郤慊伽挈倢倿偼匧厒唼喋契婕媫帹悏朅椄洯淁疌癿稧穕笡籡緁聺脞苆蕺藒蛣蛪詧跙踥鐑魥鯜鲽鰈" },
    { "qin", "亲親琴勤秦芹沁禽钦欽吣寝寢侵擒唚矜衾芩覃溱廑嗪螓噙揿撳檎锓鋟儭厪吢坅埁埐墐媇嫀寑寴嵚嶔嶜庈廞忴慬懃懄扲抋捦搇斳昑梫橬櫬涁澿濅瀙珡琹瘽矝笉綅耹肣臤菣菦菳蓁蕲藽蘄蚙螼蠄誛赺赾鈂鈊鈙雂靲顉顩駸骎鬵鮼鳹" },
    { "qing", "请請轻輕清青情晴庆慶氢氫倾傾擎顷頃卿蜻罄媇靑淸氰圊謦檠箐苘檾黥鲭鯖磬綮儬凊剠勍啨埥夝寈庼廎掅擏暒棾樈櫦殑殸涇渹漀濪玪甠硘硜碃綪莔葝軽郬鑋靘鶄" },
    { "qiong", "穷窮琼瓊穹茕煢邛蛩跫銎筇儝卭嬛宆惸憌桏橩焪焭熍琁璚瓗睘瞏竆笻舼藑藭蛬赹" },
    { "qiu", "求球秋丘邱裘酋蚯糗囚逑俅鳅鰍楸泅蝤巯巰虬虯赇賕犰湫仇鼽遒丠厹叴唒坵媝寈崷恘愀扏捄搝朹梂櫹殏毬氽氿汓浗渞湬湭煪牫玌璆皳盚秌穐篍紌絿緧肍艽莍萩蓲蘒蛷蝵蟗蠤觓觩訄訅趜趥逎醔釓釚釻銶钆鞦鞧鮂鯄鰌鰽鱃鵭鶖鹙龝" },
    { "qu", "去取区區曲趣祛驱驅躯軀屈瞿趋趨娶渠岖嶇蛐觑覷蛆龋齲蠼蘧蕖磲劬诎詘鸲鴝阒闃麴癯臒衢黢璩氍朐伹佉佢刞匤匷厺呿坥岨岴弆忂怚憈戵抾敺斪欋欪毆浀淭灈焌璖竘竬筁籧粬紶絇翑翵耝胊胠脥臞菃葋蚼蝺螶蟝蠷衐袪覰覻詓誇誳趍趜跔跙跼躣軥迲遽郥鉤鐻鑺閴阹鞫駆駈髷魼鮈鰸鱋鶌鸜麮麯麹鼁鼩匚" },
    { "quan", "全权權券泉犬圈拳劝勸痊醛铨銓颧顴筌绻綣蜷荃诠詮辁輇畎鬈悛佺勧啳圏埢姾婘孉峑巏巻弮恮惓拴捲搼栒桊棬椦楾槫権汱洤湶灥烇牶牷犈琯瑔甽矔硂絟縓腃葲虇蠸觠謜譔跧踡酄鐉闎韏駩騡鰁鳈齤犭" },
    { "que", "却卻缺确確雀鹊鵲瘸榷阙闕阕闋傕炔悫愨埆塙墧崅慤搉攉敠殻毃汋燩獡皵硞碏碻礐礭舃舄蒛蚗趞踖躤隺鳥" },
    { "qun", "群裙逡宭峮羣夋麇囷帬歏箘裠踆輑遁麏麕" },
    { "ra", "亽罖" },
    { "ram", "囕" },
    { "ran", "染燃然冉髯苒蚺姌呥嘫媣柟橪熯珃繎肰舑蒅蚦衻袇袡蹨髥冄卪" },
    { "rang", "让讓嚷瓤攘壤穰禳儴勷壌孃忀懹欀瀼爙獽穣纕蘘蠰譲躟鬤" },
    { "rao", "扰擾饶饒绕繞荛蕘桡橈娆嬈挠撓犪穘蟯襓遶隢" },
    { "re", "热熱惹喏偌捼渃蹃" },
    { "ren", "人任认認仁妊忍刃壬饪飪纫紉荏韧韌轫軔仞葚衽稔仭刄姙屻忈忎恁扨朲杒栠栣梕棯涊牣秂秹紝絍綛纴肕腍芢荵菍袵訒讱躵釰鈓銋靭靱餁魜鵀亻" },
    { "reng", "扔仍礽芿辸陾㭁㺱䄧䚮" },
    { "ri", "日囸氜釰鈤馹驲" },
    { "rong", "容荣榮绒絨融溶熔茸蓉榕嵘嶸嫆戎瑢冗栄狨蝾蠑镕鎔肜傇傛坈媶嬫宂峵嵤巆搈搑摉曧榵毧氄瀜烿爃穁穃縙羢茙螎褣軵駥髶" },
    { "rou", "肉揉柔糅媃蹂鞣厹宍楺渘煣瑈瓇禸粈腬莥葇蝚輮鍒鑐韖騥髳鰇鶔" },
    { "ru", "如入乳茹汝儒褥辱蠕孺嬬筎蓐襦铷銣嚅缛縟濡薷颥顬溽洳侞偄吺咮嗕媷嶿帤扖挐擩曘杁桇檽渪燸獳繻肗臑蒘蕠袽込邚鄏醹鑐鱬鳰鴑鴽" },
    { "rua", "挼" },
    { "ruan", "软軟阮朊偄堧壖媆嫰愞撋檽渪濡燸瑌瓀碝礝緛耎腝蝡輭" },
    { "rui", "瑞蕊锐銳鋭睿芮叡笍惢蚋枘蕤兊壡抐撋桵棁橤汭甤緌繠苼蕋蘂蘃蜹踒鏸" },
    { "run", "润潤闰閏撋橍閠" },
    { "ruo", "若弱偌箬叒婼嵶挼捼撋楉渃焫爇篛芮蒻鄀鰙鰯鶸" },
    { "sa", "撒洒灑萨薩飒颯挲仨卅脎摋攃桬檫櫒殺泧潵纚蕯訯躠鈒鎝鏾钑隡霅靸鞈馺" },
    { "saeng", "栍" },
    { "sai", "塞腮赛賽鳃鰓噻僿嗮嘥愢揌毢毸簑簺顋" },
    { "sal", "乷虄" },
    { "san", "三散伞傘叁霰叄馓饊糁糝毵毿俕傪厁叅壭帴弎橵毶潵犙糂糣糤繖蔘謲鏒鏾閐鬖彡氵" },
    { "sang", "桑嗓丧喪颡顙磉搡桒槡纕褬鎟" },
    { "sao", "扫掃嫂梢哨臊瘙搔骚騷缫繅埽鳋鰠慅懆掻橾氉溞煰燥矂縿缲繰鄵鐰颾騒髞鯵鰺鱢鲹" },
    { "se", "色涩澀瑟塞啬嗇铯銫穑穡廧愬懎拺擌栜槭歮歰洓渋溹澁濇濏瀒琗璱瘷穯粣繬虩譅轖鎍鏼铋鉍铩鎩闟雭飋" },
    { "sed", "裇" },
    { "sei", "涁聓" },
    { "sen", "森槮渗滲篸襂" },
    { "seng", "僧鬙" },
    { "seo", "閪" },
    { "seon", "縇" },
    { "sha", "杀殺沙啥纱紗莎砂痧鲨鯊傻刹煞裟霎歃铩鎩厦廈挲嗄唼乷倽儍剎唦啑喢噎帹挱摂摋榝樧濈猀硰箑粆繌繺翜翣菨萐蔱閯閷霅魦鯋" },
    { "shai", "晒曬筛篩酾釃摋攦簁簛籭繺術諰閷" },
    { "shan", "山闪閃衫扇杉珊姗姍善陕陝汕删刪膳擅缮繕煽赡贍跚鳝鱔栅柵疝膻讪訕鄯单單苫掸撣禅禪潸晱骟騸睒嬗剡蟮芟钐釤舢埏傓僐僤儃儋剼単嘇圸墠墡壇嶦幓挻掞搧擔敾曏曑杣椫樿檆櫼潬澘澹灗炶烻煔熌狦猭痁磰穇笘笧縿纔羴羶脠葠蟬蟺襂襳覢謆譱赸軕邖銏鐥閄閊顃饍鯅鱓鱣鳣彡凵髟" },
    { "shang", "上商伤傷尚赏賞裳晌墒熵觞觴绱緔殇殤垧丄仩埫塲尙恦愓慯扄滳漡禓蔏螪蠰謪踼鑜鞝鬺" },
    { "shao", "少烧燒勺绍紹芍韶邵稍捎哨梢苕杓劭鞘潲艄蛸筲佋卲娋弰旓柖溲焼玿睄笤綤绡綃莦萔萷蕱袑輎鞩韒颵髾鮹" },
    { "she", "社射设設舌奢蛇摄攝舍涉佘赊賒赦慑懾麝猞歙厍厙畲滠灄奓弽慴抴挕捨揲摂摵檨欇涻渉畬睫磼舎葉蔎虵蛞蛥蠂賖輋闍阇鞨韘騇" },
    { "shei", "谁誰" },
    { "shen", "身伸深神沈申肾腎审審甚渗滲绅紳娠慎呻婶嬸参參莘砷什珅蜃葚糁糝瘆瘮诜詵谂諗矧椹渖瀋哂胂伔侁侺兟叄叅吲嘇堔妽姺嫀孞宷屾峷幓弞愼扟抌搷昚曋柛棯椮榊槮氠涁淰燊甡甧眒眘瞋瞫矤祳穼籶籸綝罙罧脤葠蓡蔘薓蜄裑覾訠訷讅谉邥鉮鋠頣駪魫鯅鯓鯵鰰鰺鲹鵢黮" },
    { "sheng", "生声聲省升胜勝盛圣聖绳繩剩嵊晟昇笙甥牲渑澠苼眚偗冼剰呏垩墭娍媵憴斘晠曻枡榺橳殅殸泩渻湦焺狌珄琞竔箵縄蕂譝貹賸鉎鍟阩陞陹鱦鵿鼪" },
    { "shi", "使食十拾时時始失市世施石实實饰飾湿濕是室事适適试試视視诗詩识識师師驶駛狮獅示士式柿匙拭誓势勢史仕侍释釋氏蚀蝕轼軾矢逝嗜噬恃似峙屎尸屍虱什豕莳蒔埘塒铈鈰舐鲥鰣鲺鯴贳貰蓍筮炻谥諡弑酾釃螫丗乨亊佀佦兘冟卋厔叓呞呩咶唑啇埶奭姼媞嬕実宩宲寔峕崼嵵弒彖徥忕忯恀惿戺揓旹昰枾柹栻楴榁榯檡沶洂浉湜湤溡溮溼澤澨烒煶狧狶瑡畤痑眂眎眡睗礻祏禵秲竍笶笹箷篒簭籂籭絁耆胑舓葹蒒蝨褆褷襫襹觢訑諟謚辻遈遞遰遾邿醳釈釶鉂鉃鉇鉐鉽銴鍉鍦鎩铊鉈铩飠餙餝饣饬飭馶魳鮖鰘鰤鳲鳾鶳鸤鼫鼭齛齥" },
    { "shou", "售手收首瘦授守受兽獸寿壽夀狩绶綬艏収嘼垨扌掱敊涭獣痩膄醻鏉" },
    { "shu", "数數书書树樹熟输輸蔬漱舒属屬术術束蜀梳叔述暑殊鼠淑疏薯赎贖竖竪豎墅庶枢樞曙署孰戍姝恕黍菽抒摅攄秫纾紓沭毹腧塾殳澍倏侸俆俶倐儵兪咰婌孎尌尗庻忬怷悆捈捒掓暏朮杸杼柕橾毺氀涑潄潏潻濖瀭焂瑹璹疋疎癙稌籔糬紵絉綀翛荗蒁蒣薥薮藪藷虪蠴蠾裋襡襩謶跾踈軗鄃鉥錰鏣陎隃鮛鱪鱰鵨鶐鸀鹬鷸鼡忄丨" },
    { "shua", "刷耍唰涮唆誜" },
    { "shuai", "摔甩帅帥率卛衰蟀縗缞" },
    { "shuan", "栓拴闩閂涮專栒槫腨" },
    { "shuang", "双雙霜爽孀樉泷瀧傱塽孇慡欆淙滝漺灀礵縔艭鏯騻驦骦鷞鸘鹴" },
    { "shui", "水谁誰睡税稅说說娷帨挩捝氺涗涚祱脽裞説閖氵" },
    { "shun", "顺順吮瞬舜恂楯橓眴瞚瞤蕣輴鬊巛" },
    { "shuo", "说説說硕碩烁爍朔妁槊铄鑠搠蒴哾嗍欶汋洬濯獡療矟箾萷銏鎙" },
    { "shw", "折" },
    { "si", "四肆思司私饲飼丝絲撕伺俬泗似寺斯蛳螄驷駟死嗣巳祀厮廝嘶汜娰姒缌緦锶鍶耜兕笥咝噝鸶鷥厶澌俟亖佀価偲傂儩凘媤孠恖愢杫析枱柶梩楒榹泀泤洍涘瀃燍牭磃禗禠禩竢簛糸糹罒罳肂肄菥蕬蕼虒蜤螔蟖蟴覗謕貄逘釲鈶鈻鉰銉銯鋖鐁颸飔飤饴飴騃騦鷉麗鼶灬" },
    { "so", "螦" },
    { "sol", "乺" },
    { "song", "送松宋颂頌嵩耸聳诵誦怂慫讼訟淞崧竦菘悚凇忪倯傱吅娀嵷庺愯憁憽捒捴揔摗枀枩柗梥棇楤檧漎濍硹蓯蘴蜙鎹餸駷鬆" },
    { "sou", "搜艘嗽馊餿擞擻叟嗖飕颼薮藪锼鎪嗾瞍溲螋傁凁叜廀廋捒捜摗撨棷櫢欶涑潚獀瘶籔蒐蓃謏鄋醙鏉颾騪" },
    { "su", "苏蘇素速塑宿肃肅酥溯俗诉訴夙粟僳愫稣穌谡謖嗉涑簌傃蔌觫僁卹囌圱圲埣塐嫊愬憟捽摵梀棴榡樎樕橚櫯殐泝洬溸潚潥玊珟璛甦碿稡稤窣粛縤膆莤藗蘓趚蹜遡遬鋉餗驌骕鯂鱐鷫鹔" },
    { "suan", "酸算蒜狻匴撰痠祘笇筭篹" },
    { "sui", "岁歲随隨碎虽雖穗荽遂隋髓绥綏隧祟燧簑蓑嵗歳穂眭谇誶濉邃睢亗倠哸嗺埣夊娞嬘挼旞檖毸浽滖澻瀡煫熣璲瓍睟砕禭穟粋粹縗繀繐繸缞脺膸芕荾葰襚譢賥遀鏸鐆鐩陏隊靃鞖韢髄" },
    { "sun", "孙孫损損笋筍隼狲猻榫荪蓀飧喰巺扻搎摌槂潠畃箰簨蕵薞跣鎨飱鶽" },
    { "suo", "所缩縮锁鎖琐瑣索梭唢嗩嗦蓑唆挲娑睃嗍桫羧傞嫅惢挱摍暛溑溹獻琑璅簑簔縒莏葰蜶褨趖逡逤鎈鎍鎻鏁靃髿魦鮻" },
    { "ta", "他她它踏塔塌挞撻榻獭獺蹋溻遢鳎鰨牠拓沓遝趿漯铊鉈闼闥嗒侤傝呾咜嚃嚺墖崉搨榙毾涾溚澾濌狧祂禢荅褟誻譶蹹躢迏迖錔鎉鎑闒闟阘鞈鞜鞳鮙" },
    { "tae", "垈襨" },
    { "tai", "太台臺态態泰胎抬苔汰肽跆钛鈦邰酞呔炱鲐鮐薹骀駘儓冭咍囼坮夳奤嬯孡忕忲擡斄旲枱檯溙漦炲燤珆箈籉粏舦菭诒詒軚釐鈶颱" },
    { "tan", "谈談探碳毯潭坛壇炭坦檀痰坍滩灘摊攤谭譚昙曇瘫癱贪貪叹歎袒弹彈弾钽鉭郯镡鐔覃澹忐掸撣锬錟倓傝僋儃啴嗿嘆嘽嘾埮墰墵壜婒怹惔憛憳憻撢擹暺榃橝湠潬璮痑癉禪緂繵罈罎舑舕菼蕈藫裧襢譠貚賧赕醈醓醰顃餤鷤黮" },
    { "tang", "躺堂糖汤湯唐棠塘烫燙膛趟倘淌搪螳瑭傥儻樘醣镗鏜饧餳溏羰耥帑铴鐋螗伖偒傏劏啺嘡坣嵣愓戃摥攩曭榶橖欓漟漡煻爣矘磄禟篖簜糃糛膅蓎薚蘯蝪赯蹚逿鄌鎕鎲钂镋閶闛闣阊隚鞺餹饄鶶黨鼞" },
    { "tao", "套桃萄淘涛濤滔陶掏讨討韬韜逃焘燾啕绦絛洮饕鼗鞀叨仐匋咷夲夵嫍幍弢慆抭搯梼槄檮涭瑫祹綯縚縧绹蜪裪詜謟轁迯醄鋾錭鞉鞱頫飸饀駣騊" },
    { "te", "特忑慝铽鋱犆脦蟘貣㥂㧹" },
    { "teng", "疼腾騰藤滕誊謄縢漛籐籘僜儯幐痋膯虅螣邆霯駦驣鰧鼟" },
    { "ti", "提替体體题題踢蹄剃剔梯啼涕缇緹嚏惕屉屜醍倜锑銻鹈鵜绨綈裼逖褆禵媂荑悌俶偍厗啑嗁嚔奃姼媞崹嵜弚徥徲悐惖惿戻挮掦揥擿桋楴歒殢洟漽瑅瓋睇碮磃稊穉籊罤苐蕛薙虒蝭蟬衹褅謕趧趯踶蹏躰軆迏迖逷遆適鍗鐟騠骵髢髰鬀鬄鮧鮷鯷鳀鴺鶗鶙鷈鷉鷤扌" },
    { "tian", "天甜田添填舔恬腆掭忝殄钿鈿阗闐畋倎兲呑唺嗔塡娗婖寘屇悿捵搷晪栝沺淟湉琠瑱璳甛畇畑畠痶盷睓睼瞋碵磌窴紾緂胋舑舚菾覥觍賟酟銛錪鎭铦锘鍩靔靝靦顚餂鴫鷆鷏黇" },
    { "tiao", "条條跳挑调調迢眺佻窕祧龆齠笤蜩髫鲦鰷苕粜糶儵咷啁嬥宨岧岹庣恌斢旫晀朓朷樤祒窱絩聎脁脩艞芀萔蓚蓧蓨螩覜誂趒趠踔銚鋚鎥铫鞗頫鯈" },
    { "tie", "铁鐵贴貼帖萜餮鉄鐡僣呫怗惵聑蛈跕鉆銕锇鋨飻驖鴩" },
    { "ting", "停亭婷庭廷听聽艇厅廳挺葶霆汀町铤鋌珽蜓渟聴廰烃烴莛梃侱侹厛圢奵娗嵉庁庍忊桯楟榳涏濎烶珵筳綎耓聤聼脡艼蝏誔諪邒閮鞓頲颋鼮" },
    { "tol", "乭" },
    { "ton", "獤" },
    { "tong", "同通铜銅统統童痛桶筒彤桐瞳佟捅恫侗酮潼茼仝砼峒恸慟嗵垌偅僮劏勭哃囲峂峝庝憅晍曈朣樋橦氃浵湩炵烔熥燑爞犝狪獞痌眮硐硧秱穜筩粡絧綂膧艟蓪蚒蜼蟲衕詷赨鉖鉵餇鮦鲖冂" },
    { "tou", "头頭透投偷钭鈄骰亠偸埱妵婾媮敨斢殕紏緰蘣褕鋀鍮飳黈" },
    { "tu", "土图圖兔涂塗吐途突徒凸屠秃禿酴荼钍釷菟堍兎凃唋啚図圗圡堗墿宊峹嵞嶀庩廜怢悇捈捸揬摕斁梌檡汢涋湥潳瑹痜瘏稌筡腞腯莵葖蒤趃跿迌鈯鋀鋵鍎馟駼鵌鵚鵵鶟鷋鷵鼵" },
    { "tuan", "团團湍疃抟摶彖剬剸団圕塼墥嫥專慱槫檲湪漙煓猯畽磚篿糰蓴褍褖貒鏄鱄鷒鷻鹑鶉" },
    { "tui", "退腿推褪蜕蛻颓頹煺忒侻俀僓墤娧尵弚怢橔穨聉脮蓷藬蘈謉讉蹆蹪隤頺頽駾騩骽魋" },
    { "tun", "吞屯臀囤饨飩豚氽暾褪呑啍噋坉庉忳憞旽朜汭涒焞畽窀肫膯臋芚蜳豘軘錪霕魨鲀黗" },
    { "tuo", "拖脱脫托拓妥驼駝椭橢唾鸵鴕驮馱砣庹陀橐柝跎乇坨佗酡柁鼍沱箨仛侂侻咃啴嘽堶媠嫷岮彵惰扡拕挩捝撱杔杝棁楕槖毤毻汑沰涶狏砤碢磚籜紽舃舄莌萚蘀蟺袉袘袥訑託詑説讬跅踻軃迆迤迱鋖铊鉈阤陁飥饦馲駄駞騨驒驝魠鮀鰖鱓鵎鼉鼧" },
    { "uu", "屗徚斏曢朑桛歚毜毝毮洜烪焑焽燞癷皼祍稥耂聁聣艈茒蒊蓞藔虲蝊袰贘躼辪鍂鎼鐢闧霻鶑" },
    { "wa", "挖娃袜襪瓦蛙哇洼窪佤娲媧腽劸咓唲啘嗗嗢姽屲帓徍搲攨汚溛漥瓲畖砙穵窊窐聉膃譁邷靺韈韎韤黳鼃" },
    { "wai", "外歪崴呙咼喎瀤竵顡" },
    { "wan", "完万萬晚玩湾灣丸弯彎碗婉烷顽頑豌挽皖莞宛腕惋脘蜿绾綰芄娩琬纨紈剜畹菀乛倇刓卍卐唍埦塆壪夗夘妧婠孯岏帵忨惌抏捖捥掔晩晼朊杤梚椀槾汍涴潫澫琓盌睕笂箢絻綄綩翫脕苋莧莬萖薍蚖貦贃贎踠輐輓邜鄤鋄鋔鋺錽鍐鎫骩骪骫魭" },
    { "wang", "王网網旺汪望往忘枉妄亡魍瀇辋輞惘罔亾仼兦匡尢尣尩尪尫彺徃徍忹抂暀朚朢棢焹琞盳莣菵蚟蛧蝄誷迋迬" },
    { "wei", "未位胃微味唯薇威伟偉为為卫衛维維委惟韦韋魏危尾喂违違潍濰纬緯帷炜煒伪偽围圍畏巍蔚谓謂尉慰萎苇葦渭玮瑋桅帏幃韪韙娓闱闈诿諉煨痿逶葳艉鲔鮪隈沩溈涠潿崴隗洧偎猥猬嵬軎圩亹倭僞儰厃叞唩喡喴囗墛壝媁媙媦寪峗峞崣嵔嶶廆徫恑愄愇懀捤捼揋揻撝撱斖暐梶椲椳楲欈沇洈浘渨湋溦潙濊濻瀢烓煀煟熭燰爲犚犩猚琟璏瓗痏癐癓眭瞶硊硙碨磈磑緭縅罻腲芛芟苿茟荱荽菋萏葨蒍蓶蔿薳藯蘶蜲蜹蜼蝛蝟螱衞褽覣覹觹觽觿詴讆讏趡踒踓躗躛轊鄬醀錗鍏鍡鏏阢隇隹霨霺韑韡頠颹餧餵饖骩骪骫鮇鮠鰃鰄鰖鳂鳚" },
    { "wen", "问問文稳穩温溫闻聞吻纹紋雯蚊汶瘟紊刎妏忟愠慍炆鈫忞阌閿璺呅呚呡塭彣抆揾搵昷桽榅榲歾殟渂煴珳瑥瘒砇穏笏絻緼縕缊肳脕脗芠莬蕰蕴蘊薀藴蚉螡蟁褞豱輼轀辒鎾閺闅闦韞韫顐饂馼魰鰛鰮鳁鳼鴍鴖鼤亠" },
    { "weng", "翁嗡瓮甕蕹蓊勜塕壅奣嵡暡滃瞈罋聬螉鎓鶲鹟齆" },
    { "wie", "膸" },
    { "wo", "我握卧臥沃窝窩挝撾蜗蝸涡渦斡幄莴萵喔渥倭龌齷肟硪仴偓唩噁嚄埚堝婐婑媉媪媼捰捼捾擭杌枂楃涴涹濄濣焥猧瓁瘟瞃矆腛臒艧蒦薶踒踠雘馧龏" },
    { "wu", "无無五伍武务務物午舞屋吴吳乌烏污汙勿捂悟吾误誤雾霧芜蕪妩嫵梧蜈鹉鵡邬鄔婺坞塢晤钨鎢鹜鶩戊侮毋诬誣巫兀忤骛騖汚呜嗚怃憮恶惡牾寤阢於鋈仵杌迕痦芴焐庑廡鼯浯圬乄亾仡伆侉俉倵儛兦剭呉啎噁垭埡堥墲奦娒娪娬屼岉峿嵍嵨幠弙忢悞悮扜扝扤揾摀敄旄旿杅杇柮橆歍沕洖洿渞溩潕熃熓玝珷珸瑦璑甒瞀瞴矹碔祦禑窏窹笏箼粅膴茣莁蘁螐蟱誈譕趶躌逜郚釫鋘鋙錻铻陚隖雺霚霿靰鯃鰞鴮鵐鷡鹀鼿齀龉齬唔蝥" },
    { "xi", "西洗细細吸喜希熙禧系席息熄锡錫膝惜习習稀皙囍夕悉析兮戏戲溪茜矽晰昔媳硒隙栖棲汐熹玺璽犀蜥奚浠淅蟋徙曦羲嘻唏蹊袭襲檄牺犧嬉琋晞烯郗铣銑葸饩餼屣禊翕穸僖蓰舾醯欷隰螅歙樨阋鬩粞觋覡菥鼷裼舄係俙傒凞匸卌卥卻厀吚呬呰咥咭唽噏嚊嚱壐奊娭媐嬆宩屃屖屭嵠嶍嶲巂巇廗徆徯忔忚忥怬怸恄悕惁慀憘憙戯戱扱扸摡擊晳暿杫枲桸椞椺榽槢橀橲欪欯歖氥渓滊漇漝潝潟澙焁焈焟焬煕熂熈熺熻燍燨爔犔犠狶獡獻瓕瘜盻睎瞦矖碏磶礂稧窸糦綌緆縘縰繥繫纚绤羛翖肸肹胁脅脇脋舃莃莔葈蒠蒵蓆蔇蕮薂虩蜤蜴蝷螇蟢蠵衋褶覀覤觹觽觿訢詑諰謑謚謵譆诶誒谿豀豨豯貕赥赩趇趘蹝躧遟郄郤郋鄎酅釐釳釸鈒鈢鉨鉩鎴鏭鑴钑闟隟隵雟雭霫霼飁餏餙饻騱騽驨鯑鰼鱚鳛鵗鸂黖鼰鼳" },
    { "xia", "下夏虾蝦霞厦廈峡峽匣侠俠吓嚇瞎狭狹辖轄暇遐瑕葭蕸狎柙呷黠硖硤罅丅傄叚嗄嗑圷埉夓夾岈徦懗捾搳敮昰梺欱毳浃浹溊炠烚煆珨疜疨瘕睱碬磍祫笚筪縀縖翈舝舺芐螛諕謑谺赮鍜鎋鏬閕閜陜陿颬騢魻鰕鶷" },
    { "xian", "先线線綫限鲜鮮现現显顯仙贤賢纤纖县縣险險咸鹹腺掀闲閑献獻弦宪憲馅餡衔銜嫌陷舷涎羡羨娴嫻痫癇暹氙霰锨鍁籼秈県険铣銑苋莧藓蘚岘峴莶薟蚬蜆猃獫祆冼燹跣跹躚酰醯鹇鷳筅仚伣伭佡俔僊僩僲僴咁咞哯唌啣嗛嘕垷埳壏奾妗妶姭姺娊娨娹婱嫺嬐孅寰尟尠屳崄嶮幰廯忺慊慳憪憸懢挦揱搚搟撊撏攇攕晛杴枮梘槏橌櫶欦毨涀湺溓澖濂瀗灦烍狝獮玁玹珗甉癎盷睍瞯矣硍礆礥禒禰稴笕筧箲粯糮絃絤綅綖縿繊纎缐羬胘脇脋膁臔臤臽苮蔹蘞藖蘝蚿蛝衘褼襳誢誸諴譀譣豏贒赻蹮軐輱醎醶銛鋧錎鍌鏾鑦钐釤铦锬錟閒陥韅韯韱顈顕饀馦鰔鱻鶱鷴鷼麙麲黹鼸" },
    { "xiang", "想向香箱相翔湘祥项項响響乡鄉象像巷享镶鑲详詳厢廂襄降橡饷餉飨饗鲞鯗骧驤蟓庠芗薌缃緗葙亨亯佭傢儴勨勷啌啍嚮姠嶑忀攘晑曏栙楿欀潒珦瓖瓨絴纕缿羏膷舡萫蘘蚃蠁衖襐跭迒郷鄊鄕銄銗鋞鐌閧闀闂饟鬨鮝鱌鱜鱶鴹麘" },
    { "xiao", "效小笑消校晓曉逍削宵肖霄孝骁驍销銷萧蕭箫簫啸嘯哮嚣囂硝筱潇瀟枭梟淆魈蛸哓嘵崤绡綃篠枵侾俲傚効叜呺咲啋嗃嘋嘐嘨嚻婋宯庨彇恔恷憢揱撨敩斅斆暁橚櫹歊歒歗殽毊洨涍滧漻潚澩灱灲烋焇熇熽燆燺爻猇獟獢痚痟皛皢睄硣穘窙笹筿箾簘縿翛脩膮茭莦萷薂藃虈虓蟂蟏蟰蠨訤詨誟誵謏謞謼譊踃轇郩颵骹髇髐鴞鴵鵁鷍鷕鸮" },
    { "xie", "写寫鞋谢謝协協械斜血些卸偕蟹屑泻瀉懈泄谐諧挟挾蠍携攜邪歇胁脅蝎榭亵邂楔契绁絏颉頡缬纈獬廨撷擷瀣渫榍薤躞燮勰伳偞偰僁儶冩劦卨吤喈嗋噧垥塮夑夾奊娎媟孈屓屜屟屧屭峫嶰徢恊愶慀拹揳搚摺擕旪暬枻榝槷殺洩湝溉滊澥灺炧炨烲焎熁燲爕猲瑎眭碿祄禼糏紲絜絬綊緤緳繲缷翓脇脋膎薢藛蝑蝢蠏衺裌褉褻襭觟觧譮讗躠鍱鐷隰鞢鞵韰骱鬹魼鲑鮭齂齘齛齥龤" },
    { "xin", "新心欣信芯馨鑫锌鋅辛薪忻歆莘昕衅釁囟镡鐔伈伩俽噷噺妡姰嬜孞庍廞惞愖憖撢杺枔橝欵歀潃炘焮盺礥脪舋襑訢訫軐邤鈊阠顖馫馸鬵" },
    { "xing", "型性行形星姓兴興杏幸醒腥刑邢猩惺悻荥滎郉倖婞硎陉陘擤荇侀哘坓坙垶塂娙嫈嬹巠曐洐涬煋熒狌瑆皨睲硏箵篂緈臖莕蛵裄觪觲謃鈃鉶銒鋞钘铏饧餳騂骍鮏鯹" },
    { "xiong", "胸雄兄熊汹洶匈凶忷恟芎兇哅夐敻昫焸胷訩詗詾讻诇賯赨" },
    { "xiu", "修锈鏽銹休秀绣繡綉袖羞嗅朽貅咻珛琇岫溴馐饈宿繍髹鸺鵂庥俢嚊樇櫹滫烋烌璓糔綇脙脩臰臹苬茠莠蓨螑裦褎褏銝鎀鏅鏥飍髤鮴鱃齅" },
    { "xu", "许許须須需续續序畜徐旭恤蓄虚虛叙敘絮婿绪緒煦勖栩戌酗诩詡胥嘘噓吁籲墟糈蓿顼頊圩洫醑溆盱砉亐伃伵侐俆偦冔勗卹呴喣嘼垿壻姁媭嬃幁怴惐慉掝揟敍旴昫晇暊朂朐楈槒欨欰欻歔歘殈汿沀淢湑滀漵潊烅烼獝珝珬疞盢盨眗瞁瞲矞稰稸窢続緖緰縃繻聟肷膁胊芌芧蒣蓲蕦藇藚虗蚼蛡蝑訏訹諝諿謣譃谞賉鄦鉥銊鑐雩馘驉鬚魆魖魣鱮" },
    { "xuan", "选選旋宣轩軒绚絢玄悬懸眩暄漩泫铉鉉璇璿喧镟鏇炫妶媗嫙瑄癣癬煊碹楦儇渲揎萱痃谖諼亘亙吅咺喛塇夐姰弲怰愃愋懁揈擐昍昡晅暅暶梋楥檈澴烜煖狟獧玆玹琁琄瓊盤眴睻矎禤箮絃縣縼繏翧翾萲蓒蔙蕿藼蘐蜁蜎蝖蠉衒袨諠譞讂贙轋還鋗鍹鐶镮鞙颴馔饌駨駽鰚" },
    { "xue", "学學雪血靴穴薛削噱鳕鱈谑謔踅泶澩乴勪吷坹壆岤峃嶨怴斈桖梋樰泧泬滈瀥炔烕燢狘疦疶瞲膤艝茓蒆袕觷趐轌辥雤鞾韡鷽鸴" },
    { "xun", "寻尋讯訊熏迅薰循旬巡荀询詢训訓驯馴汛逊遜勋勳勛鲟鱘浔潯荨蕁殉洵峋珣醺埙塤恂浚巽獯郇蕈窨曛徇伨侚偱勲卂咰噀噚嚑坃壎壦奞姰廵悛愻揗撏攳杊栒桪樳殾毥潭濬灥焄煇燂燅燖燻爋爓狥狻璕眴矄稄筍筼篔紃纁臐蔒薫蘍蟫蟳襑訙賐迿逡鄩鑂鑫顨駨鱏鶽彐" },
    { "ya", "压壓牙押雅亚亞鸭鴨芽涯呀娅婭哑啞崖丫轧軋鸦鴉衙讶訝蚜垭埡琊吖疋砑桠椏睚痖瘂岈玡氩氬崕厓堐伢笌亜迓揠乛俹倻劜厊呾唖圔圠圧堊姶孲庌庘拁挜掗枒椻浥漄潝烏犽猚猰瑘疨磍稏穵窫聐蕥襾輵釾錏鐚铔鵶鶕鼼齖齾" },
    { "yan", "眼烟煙演严嚴验驗炎燕颜顏沿盐鹽言宴岩研艳豔妍咽延焰胭焱腌醃淹掩鄢堰雁厌厭砚硯彦彥蜒衍谚諺赝贗阎閻晏闫閆焉筵兖兗湮偐鼹檐簷阉閹魇魘唁奄芫厣厴阏閼菸琰滟灩剡餍饜恹懨罨偃谳讞俨儼郾酽釅崦阽乵偣傿円剦匽厃厳唌喦喭噞嚥囐埏埯垵塩墕壛壧夵妟姲姸娫娮媕嬊嬐嬮嬿孍屵嵃嵒嵓嶖嶮巌巖巗巘巚弇愝懕戭扊抁挻掞揅揜揞敥昖晻暥曕曮棪椻椼楌樮橪檿櫩欕殗氤沇洇洝淊渰渷湺溎漹灎灔灧炏烻焔熖燄爓牪狿猒珚琂瓛甗硏硽碞礹篶綖縯膁臙艶艷莚莶菴萒葊葕蔅薟虤蝘裺褗覎觃觾訁訮詽讌讠豓豜豣贋趼躽軅遃郔酀酓醶醼錟锬阭陰隁隒靥靨顑顔顩騐験騴驠鬳鰋鳫鳱鴈鴳鶠鷃鷰麙麣麲黡黤黫黬黭黰黶鼴齗齞齴龂龑" },
    { "yang", "样樣养養羊洋阳陽扬揚氧杨楊央鸯鴦秧仰痒癢漾殃佯疡瘍炀煬恙徉鞅泱烊怏佒蛘傟劷勜卬咉坱垟奍姎婸將岟崵崸慃懩抰攁敭旸昜暘柍楧様歍氜氱湯潒瀁炴珜瑒眏眻礢禓紻羏羕羘羪胦詇諹軮輰鉠鍈鍚鐊钖阦雵霙霷颺飏飬駚鰑鴹鸉" },
    { "yao", "要药藥咬腰邀姚耀钥鑰摇搖妖遥遙瑶瑤尧堯夭窑窯杳窈娆嬈谣謠舀珧繇薬揺謡鳐鰩鹞鷂疟瘧轺軺爻吆铫銚幺崾肴曜徭仸倄偠傜匋喓嗂噛嚙垚婹媱宎尭岆峣嶢嶤徺怮恌愮抭摿撽暚曣枖柼楆榚榣殀殽洮溔滛瀹烄烑熎燿狕猶猺獟玅眑矅磘祅穾窅窔窰筄箹纅艞苭荛葯葽蓔蕘蘨袎覞訞詏讑趯踰鎐闄隃靿顤颻飖餆餚騕鴁鴢鷕鼼齩" },
    { "ye", "业業液野叶葉夜页頁爷爺也椰腋冶晔曄烨燁掖噎耶曳谒謁邺鄴揶铘鋣靥靨亪亱倻偞僷吔啘嘢嚈埜堨墅墷壄峫嶪嶫懕抴捓捙揞揲擖擛擨擪擫暍曅曗枒枼枽楪歋殕殗洂洇漜潱澲煠熀爗瓛痷皣瞱瞸礏窫緤虵蠮蠱鄓釶釾鍱鎁鎑鐷餣饁饐馌驜鵺鸈黦" },
    { "yi", "一壹衣易医醫仪儀益宜谊誼艺藝疫亿億忆憶意移依怡乙椅逸翼弈奕颐頤毅以已亦议議义義译譯异異溢伊遗遺胰沂蚁蟻翌倚姨驿驛抑绎繹屹羿彝矣役臆裔夷诣詣怿懌懿疑诒詒饴飴漪佚贻貽弋蜴薏翊轶軼祎禕邑咦噫嶷缢縊揖铱銥肄痍镒鎰癔旖熠酏欹峄嶧圯殪嗌劓咿瘗猗眙苡荑仡佾钇釔迤刈悒黟翳埸挹呓囈镱鐿舣艤丿乁乂亄伇伿佁佗侇俋偯儗兿冝劮勚勩匇匜叕吚呭呹唈圛圪坄坨垼埶墿壱夁妷媐嫕嫛嬄嬑嬟孴宐宧寱寲峓崺嶬巳巸帟帠幆庡廙弌弬彛彜彞彵忔怈恞悘悥戺扅扆扡拸掎掜搋搤撎攺敡敼斁旑昳晹暆曀曎曵杙杝枍枻柂栘栧栺桋棭椬椸榏槷槸樴檍檥檹櫂欥欭歖歝殔殹毉沶泆洢洫浂浥浳渫湙潩澤澺瀷炈焬焲熈熤熪熼燚燡燱犄狋狏獈玴珆瑿瓵畩痬瘞瘱睪瞖硪礒礙秇稦穓竩笖箷簃籎紲繄繶绁絏羛羠耛耴肊膉艗芅苅苢萓萟蓺藙蘙虉蛜蛡蛦螔螘螠衤衪衵袂袆袘袣裛裿褘褹襗襼觺訑訲訳詍詑誃誒謚謻譩譺讉讛诶豙豛豷貖貤賹贀跇跠踦輗輢轙辥辷迆迭迱迻逘郼醳醷釴釶鈘鈠鉇鉈鉯銕錡鏔钀铊锜阣阤陁陭隿霅霬靾頉頥顊顗饐駅骮鮧鮨鯣鳦鴺鶂鶃鶍鷁鷊鷖鷧鷾鸃鹝鹢鹥黓黝黳齮齸" },
    { "yin", "因印银銀音饮飲引隐隱茵吟尹寅殷姻阴陰荫蔭胤龈齦蚓瘾癮鄞淫隠堙喑夤吲圻狺垠霪氤铟銦窨洇茚乑乚伒侌傿冘凐唫噖噾嚚囙圁垔垽堷婣婬峾崟崯嶾廕愔慇慭憖憗懚斦朄栶梀檃檭檼櫽欭欽歅殥泿洕淾湚溵滛濥濦烎犾猌玪珢璌瘖癊硍碒磤禋秵筃粌絪緸縯芩苂荶蒑蔩蘟螾蟫裀訔訚訡訢誾諲讔赺趛輑酓酳釿鈏鈝闇闉阥陻隂霒霠靷鞇韾飮駰骃鮣鷣齗龂" },
    { "ying", "营營迎英婴嬰硬应應映赢贏鹰鷹颖穎莹瑩盈樱櫻影荧熒萤螢缨纓蝇蠅鹦鸚莺鶯萦縈郢瑛滢瀅嬴荥滎膺颍潁罂罌楹営桜蛍蓥鎣瘿癭茔塋媵璎瓔嘤嚶撄攖潆瀠瀛媖俓偀僌啨噟夃嫈孆孾嵤巆巊廮応愥摬攍攚旲暎朠柍桯梬櫿泂浧渶溁溋濙濚濴瀯瀴灐灜焸煐珱甇甖盁眏矨碤礯籝籯緓縄绬罃耺膡莖萾藀蘡蝧蝿蠳褮覮謍譍譻賏軈鐛鑍锳霙鞕韹韺頴颕鱦鴬鶧鷪鸎" },
    { "yo", "哟喲育唷嚛" },
    { "yong", "用永拥擁勇雍咏詠泳庸涌蛹佣傭甬俑踊踴臃恿壅慵墉痈癰鳙鱅邕喁饔镛鏞傛勈嗈噰埇塎嫞嵱廱彮怺悀惥愑愹慂揘柡栐槦湧滽澭灉牅癕砽硧禜筩臾苚蒏蕹郺鄘醟銿雝顒颙鯒鰫鲬鷛" },
    { "you", "有又由右油幼优優友柚游遊悠邮郵佑幽鱿魷釉忧憂尤犹猶诱誘酉疣攸莠黝猷宥鼬铀鈾蚰卣莸蕕蚴牖囿蝣莜蓧铕銪蝤呦侑丣亴偤冘哊唀嚘坳妋姷孧尢尣峟峳庮怞怣怮懮戭揂斿栯梄梎楢槱櫌櫾汓汼沋泅泈泑浟湵滺瀀牗牰狖獶甴痏祐禉秞糿纋羐羑羗耰聈聱肬脜脩苃莤蒏蚘蜏褎褏訧貁輏輶迶逌逰邎鄾酭駀鮋鲉麀" },
    { "yu", "鱼魚雨余餘玉育羽宇语語浴虞誉譽娱娛愉寓裕禹芋渝遇俞预預御禦渔漁豫瑜昱禺煜钰鈺域毓与與于於喻榆欲愈予愚淤舆輿屿嶼迂逾竽妤盂峪隅庾谕諭彧狱獄驭馭郁鬱吁籲谀諛尉蔚妪嫗嵛崳雩馀阈閾窬鹆鵒揄窳觎臾舁龉齬蓣蕷纡紆聿欤歟俣俁伛傴圄鹬鷸萸瘐鬻圉瘀饫飫燠腴狳菀蜮蝓丂亐伃俼偊僪儥兪匬叞吳唹喁喅喐喩噊噢噳圫堉堣堬墺娪娯婾媀媮嬩寙峿嵎嶎庽忬悆悇惌惐慾懙戫扜扵拗挧捓敔斔斞旟杅栯桙棛棜棫楀楡楰櫲欎欝歈歶汚汩淢淯湡滪澚澞澦灪灹焴燏燰爩牏獝玗玙琙琟瑀璵畬畭痏瘉癒盓睮矞砡硢礇礖礜祤秗稢稶穥穻箊篽籅籞紆緎繘罭羭翑腧艅芌茟茰荢菸萭萮蒮蓹蕍薁藇蘌蘛虶蜍蜟蝺螸蟈衘衧袬褕覦謣貍貐貗踰軉輍轝迃逳遹邘郚鄅酑醧釪銉鋊鋙錥鍝鐍鐭铻阏閼陓隃隩雓霱頨顒颙饇騟驈骬髃鬰魊魣鮽鯲鰅鱊鱮鳿鴥鴧鴪鷠鸆鸒麌齵肀" },
    { "yuan", "元远遠员員原圆圓园園源院愿願媛缘緣袁渊淵援苑鸳鴛猿怨冤鸢鳶垣辕轅圜宛鼋橼爰眢掾芫沅瑗螈箢塬垸傆剈厡厵喛噮囦圎夗妧妴媴嫄嫚嬽寃弲悁惌杬棩楥榞榬櫞涴渁渆渕湲溒灁焆猨獂盶禐笎縁羱肙葾蒝蒬薗薳蚖蜎蜵蝝蝯衏裫裷褑褤謜貟贠輐逺邍邧酛鈨鋺鎱駌騵魭鵷鶢鶰鹓黿鼘鼝" },
    { "yue", "月越约約跃躍岳嶽粤悦悅玥阅閱閲乐樂钥鑰鈅曰瀹钺鉞刖龠栎櫟樾哕噦哾囝妜嬳岄彟彠恱戉扚抈捳擽曱枂汋焆爚矆矱礿禴箹篗籆籥籰粵臒蘥蚎蚏蠖趯跀跞躒軏铄鑠髺鸑鸙黦龥" },
    { "yun", "云雲运運允匀勻孕韵韻芸蕓熨耘晕暈妘纭紜陨隕蕴蘊藴酝醞郧鄖媪媼氲氳恽惲愠慍郓鄆筠韫韞昀狁殒殞伝傊叞呍喗囩夽奫愪抎抣枟榅樂橒沄涒涢溳澐煇煴煾熅熉玧畇眃磒秐筼篔緷緼縕縜繧缊耺腪荺菀蒀蒕蒷蕰薀蜵蝹褞貟賱贇贠赟輼轀辒醖鈗鋆阭霣韗頵餫馧馻齫齳" },
    { "za", "杂雜砸咋扎紮匝咂拶啈啐喒嘁噈囃囋囐帀桚沞沯濽灒磼籴糴紥臜臢襍鉔雑雥韴魳" },
    { "zad", "曱" },
    { "zai", "在再载載仔栽宰灾災哉崽甾傤儎扗洅渽溨烖睵縡菑賳酨" },
    { "zan", "咱暂暫赞贊攒攢簪瓒瓚趱趲糌拶昝錾鏨偺儧儹兂喒囋寁揝撍桚涔湔濺濽灒瓉禶穳篸簮臢襸讃讚賛蹔鄼酂酇鏩鐕鐟饡" },
    { "zang", "脏髒赃贓藏葬奘臧驵駔匨塟弉戕牂牫羘臓臟蔵賍賘贜銺驡" },
    { "zao", "造早皂澡灶枣棗噪遭糟燥凿鑿躁藻蚤唣傮唕喿慥栆梍槽煰璅璪皁窖竃竈簉缫繅缲繰艁薻謲譟趮蹧醩" },
    { "ze", "责責择擇泽澤则則箦簀舴帻幘迮啧嘖仄昃笮赜賾伬厠唶啫夨嫧崱庂択捑昗柞樍歵汄沢泎溭滜灂皟睪瞔矠礋稄耫萚葃蔶蘀蠌襗諎謮讁飵鸅齚齰" },
    { "zei", "贼賊蠈鰂鱡鲗" },
    { "zen", "怎谮譖僭囎撍譛" },
    { "zeng", "赠贈增憎曾锃鋥缯繒罾甑増曽橧熷璔矰磳縡譄鄫鬷鱛" },
    { "zha", "炸榨楂扎紮渣闸閘眨轧軋乍栅札劄铡鍘诈詐咋吒猹蚱喳查砟痄哳揸摣喋柞咤齄齇偞偧剳厏喥囃奓宱怍扠抯拃挓挿揷搩搾擖柤柵樝溠潳灹煠牐甴皶皻笮箑箚紥耫膪苲苴蔖蕏藸蚻觰諎謯譇譗踷蹅迊醡霅鞢鮓鮺鲊鲝鲽鰈齰龃齟馇餷" },
    { "zhai", "摘窄债債宅斋齋寨翟择擇祭砦瘵亝厇厏啇嚌夈抧捚擿斎榸檡牴疵箦簀粂膪鉙骀駘骴" },
    { "zhan", "站占沾展粘战戰绽綻斩斬毡氈蘸湛栈棧詹辗輾崭嶄瞻谵譫盏盞霑颤顫搌旃亶佔偡噡嫸嵁嶃嶘嶦怗惉戦拃旜栴桟椾榐橏欃氊湔澶琖皽碊菚薝虥虦蛅袒襢覱詀譧讝趈跕蹍躔輚轏邅醆醮閚飐颭飦餰饘驙骣驏魙鱣鳣鳽鸇鹯點黵" },
    { "zhang", "张張章帐帳掌涨漲账賬丈樟杖彰漳胀脹仗瘴障璋长長仉嫜幛鄣嶂獐蟑仧傽墇幥弡慞扙暲涱痮瘬瞕礃粀粻蔁遧鏱鐣镸鞝餦騿鱆麞" },
    { "zhao", "找照罩兆招昭沼肇召赵趙诏詔钊釗朝爪着著棹啁笊佋啅垗妱巶旐曌枛櫂濯炤燳爫狣瑵皽盄瞾窼箌罀羄肁肈菬蚤謿釽鉊鍣駋鮡鳭鼂鼌" },
    { "zhe", "这這者折浙遮哲蔗着著褶摺辙轍蛰蟄鹧鷓谪謫嗻锗鍺柘辄輒赭磔蜇乇仛厇啠喆嗫囁嘀嚞埑堵嫬悊慹扸摂晢晣杔棏樀樜歽淛潪矺砓籷粍聑虴蟅袩褚襵詟謶謺讁讋輙適銸陬馲驝鮿鸷鷙" },
    { "zhen", "真眞圳震枕振珍甄臻针針镇鎮疹诊診贞貞阵陣斟赈賑帧幀侦偵缜縝箴轸軫榛稹朕鸩鴆胗萙祯禎浈湞桢楨禛砧蓁畛椹侲坫塡塦嫃寊屒帪弫戡抮挋揕搸敒敶昣朾枮栕栚桭榐槇樼殝沴沵溱潧澵獉珎瑧眕眹碪竧籈紖紾絼縥纼聄葴蒖薽蜄袗裖覙誫謓趂轃辴迧遉酖酙鈂鉁鋴錱鍖鍼鎭陳靕駗鬒鮝鱵鲞黮黰鼑" },
    { "zheng", "正整证證政争爭蒸征症郑鄭挣掙睁睜拯狰猙峥崢怔钲鉦铮錚诤諍徵筝箏帧幀証鲭鯖佂凧埥埩塣姃媜崝嶒徎徰徴愸憕抍掟揁撜敞晸氶浧湞炡烝癥眐篜糽綪聇脀踭鬇鮏鯹鴊" },
    { "zhi", "至止制製智质質址值志直汁殖只支脂芝枝治置织織知纸紙之指肢职職执執致植蜘炙痣滞滯旨侄姪吱稚痔趾窒挚摯帜幟峙郅咫秩貭祉蛭芷掷擲栀梔帙摭黹桎枳轵軹忮膣觯觶彘祗鸷鷙絷縶踬躓胝骘騭轾輊陟踯躑雉埴贽贄卮酯豸跖蹠栉櫛乿亊伎俧倁値偫傂儨凪剬劕劧厔咥嚔坁坧垁墆墌夛妷娡媞嬂寘崻巵帋庢庤廌徏徔徝徴徵恉慹憄懥懫戠扺扻抧拞挃捗搘搱摕摨擳擿斦旘晊杝杫柣栺梽椥楖榰槜樀樲樴櫍歭氐汥汦沚泜洔洷淽滍漐潌潪瀄熫犆狾猘瓆瓡畤疐疷疻瘈眰砋礩祇祑祬禃禔秇秓秖秪秲秷稙稺穉筫紩絺綕緻翐聀胑胵膱臷臸芖茋茝菭薙藢蘵虒蚔螲蟙衹衼袟袠襧覟觗觝訨誌謢豑豒跱踶蹛蹢軄軽迣遟釞鉄銍銴鋕鑕铚锧阤阯陁隲隻馶馽駤騺驇鯯鳷鴙鴲鶨鼅夂" },
    { "zhong", "中重种種终終众眾钟鐘忠肿腫仲衷盅踵舯螽锺鍾冢塚忪乑伀偅刣喠堹妐妕媑尰幒彸徸柊歱汷泈炂煄狆瘇祌穜筗籦緟茽蔠蚛蝩螤蟲衆衳衶褈諥蹱迚鈆鈡銿鴤鼨夂" },
    { "zhou", "周州宙洲舟粥肘轴軸昼晝皱皺骤驟诌謅帚咒胄纣紂绉縐妯箒荮葤啁碡籀酎伷侜倜僽冑呪咮喌噣嚋婤徟掫晭椆洀淍炿烐珘甃疛盩睭矪箒籒籕粙紬翢胕舳菷薵詋詶譸诪诹諏调調賙赒輈輖辀週郮銂霌駎駲騆驺騶鬻鯞鵃鸼" },
    { "zhu", "住主猪豬竹煮筑築祝珠助朱注柱株铸鑄驻駐贮貯嘱囑拄瞩矚蛛诸諸诛誅逐烛燭蛀柱侏铢銖杼鋳箸炷竺潴瀦洙伫佇瘃翥茱苎苧橥櫫舳疰渚褚躅麈邾槠櫧劅劚劯咮嗻噣坾墸壴孎宔尌嵀搊敱斀斸曯枓柷楮樦櫡欘殶泏澍濐灟炢煑爥眝砫硃磩祩秼窋竚笁笜筯篫篴紵紸絑纻罜羜芧茿莇蓫蕏薥藷藸蚰蝫蠋蠩蠾袾註詝跓跙跦軴迬逫鉏鉒钃陼霔飳馵駯驺騶鮢鯺鱁鴸鸀麆鼄著丶" },
    { "zhua", "抓爪挝撾摣檛簻膼髽" },
    { "zhuai", "拽跩尵捙睉顡嘬" },
    { "zhuan", "转轉专專赚賺砖磚传傳撰篆颛顓馔饌啭囀僎僝剸叀堟塼嫥孨専恮抟摶漙灷瑑瑼甎竱篹篿簨籑縳耑腞膞蒃蟤襈諯譔転鄟鱄" },
    { "zhuang", "装裝妆妝庄莊壮壯撞状狀桩樁幢荘僮奘戆戇丬壵娤庒憧戅梉湷漴焋獞粧糚艟贑" },
    { "zhui", "追坠墜缀綴锥錐椎赘贅骓騅惴缒縋隹倕埀娷槌沝甀畷硾磓礈笍箠腏膇萑諈轛醀醊錗錣鎚鑆隊隧餟鵻" },
    { "zhun", "准準谆諄肫窀凖啍圫埻宒忳旽湻甽盹稕綧胗衠訰迍黱" },
    { "zhuo", "捉桌着著卓灼浊濁茁酌镯鐲啄拙擢焯涿濯琢诼諑浞倬禚斫丵剢劅叕啅啜噣圴坧墌妰娺彴捔掇撯擆斀斮斱斲斵晫梲棁棳棹椓槕櫡汋淖準灂炪烵犳狵琸矠硺穛穱窡窧箸篧籗籱罬聉肫蓔蕞藋蝃蠗蠿諁謶趠趵踔蹠躅鉵鋜鐯鵫鷟杓" },
    { "zi", "自子紫资資姿籽字咨渍漬滋孜淄梓吱兹秭恣姊辎輜滓仔笫粢龇齜谘諮趑缁緇鲻鯔锱錙孳耔觜髭赀貲茈訾嵫眦倳剚吇呰呲啙嗞姉姕孖孶崰杍栥椔榟橴沝泚洓湽澬牸玆璾甾疵眥矷禌秄秶稵穧紎胏胔胾芓茊茡茲菑葘蓻薋虸訿赼趦跐輺鄑釨鈭鍿鎡镃頾頿鰦鶅鼒齍" },
    { "zo", "咗唨" },
    { "zong", "总總宗棕综綜粽纵縱枞樅踪蹤鬃偬傯腙倊倧堫嵏嵕嵸從惣惾愡捴揔搃摠昮朡椶潀潈潨熜熧燪猔猣疭瘲碂磫稯糉緃総緫緵縂縦翪艐葼蓗蓯蝬豵踨錝鍯鏓鑁騌騣骔鬉鬷鯮鯼" },
    { "zou", "走揍奏邹鄒驺騶诹諏鲰鯫鄹掫陬偢媰搊棷棸楱箃緅芻菆赱郰鯐黀齱齺辶" },
    { "zu", "组組族足租祖阻诅詛镞鏃卒菹俎伜伹倅傶卆哫啐嘁岨崒崪徂怚柤淬爼珇砠稡箤紣綷苴葅蒩謯趱趲踤踿蹴鉃鉏鉐錊鎐鎺鑿靻顇驵駔" },
    { "zuan", "钻鑽赚賺纂缵纘躜躦攥劗揝撮攒攢欑篹籫繤纉鑚" },
    { "zui", "最嘴醉罪咀蕞觜厜嗺噿嫢嶉嶊嶵撮晬朘枠栬槯樶檇檌欈濢璻睟祽稡穝絊纗羧脧蟕辠酔酨酻鋷錊雋" },
    { "zun", "尊遵鳟鱒樽撙僎僔噂墫奠嶟拵捘捽栫瀳繜罇袸譐跧踆蹲銌鐏鶎鷷" },
    { "zuo", "做作坐左座昨佐撮琢唑祚笮酢凿鑿胙怍阼柞侳咗岝岞挫捽柮椊砟秨稓筰糳繓苲莋葃葄蓙袏諎鈼飵嘬阝" },
    {NULL, NULL}
};

#endif
#endif

/**********************
 *      MACROS
 **********************/

/**********************
 *   GLOBAL FUNCTIONS
 **********************/
lv_obj_t * lv_ime_pinyin_create(lv_obj_t * parent)
{
    LV_LOG_INFO("begin");
    lv_obj_t * obj = lv_obj_class_create_obj(MY_CLASS, parent);
    lv_obj_class_init_obj(obj);
    return obj;
}


/*=====================
 * Setter functions
 *====================*/

/**
 * Set the keyboard of Pinyin input method.
 * @param obj  pointer to a Pinyin input method object
 * @param dict pointer to a Pinyin input method keyboard
 */
void lv_ime_pinyin_set_keyboard(lv_obj_t * obj, lv_obj_t * kb)
{
    if(kb) {
        LV_ASSERT_OBJ(kb, &lv_keyboard_class);
    }

    LV_ASSERT_OBJ(obj, MY_CLASS);
    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    pinyin_ime->kb = kb;
    lv_obj_add_event_cb(pinyin_ime->kb, lv_ime_pinyin_kb_event, LV_EVENT_VALUE_CHANGED, obj);
    lv_obj_align_to(pinyin_ime->cand_panel, pinyin_ime->kb, LV_ALIGN_OUT_TOP_MID, 0, 0);
}

/**
 * Set the dictionary of Pinyin input method.
 * @param obj  pointer to a Pinyin input method object
 * @param dict pointer to a Pinyin input method dictionary
 */
void lv_ime_pinyin_set_dict(lv_obj_t * obj, lv_pinyin_dict_t * dict)
{
    LV_ASSERT_OBJ(obj, MY_CLASS);

    init_pinyin_dict(obj, dict);
}

/**
 * Set mode, 26-key input(k26) or 9-key input(k9).
 * @param obj  pointer to a Pinyin input method object
 * @param mode   the mode from 'lv_keyboard_mode_t'
 */
void lv_ime_pinyin_set_mode(lv_obj_t * obj, lv_ime_pinyin_mode_t mode)
{
    LV_ASSERT_OBJ(obj, MY_CLASS);
    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    LV_ASSERT_OBJ(pinyin_ime->kb, &lv_keyboard_class);

    pinyin_ime->mode = mode;
}

/*=====================
 * Getter functions
 *====================*/

/**
 * Set the dictionary of Pinyin input method.
 * @param obj  pointer to a Pinyin IME object
 * @return     pointer to the Pinyin IME keyboard
 */
lv_obj_t * lv_ime_pinyin_get_kb(lv_obj_t * obj)
{
    LV_ASSERT_OBJ(obj, MY_CLASS);

    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    return pinyin_ime->kb;
}

/**
 * Set the dictionary of Pinyin input method.
 * @param obj  pointer to a Pinyin input method object
 * @return     pointer to the Pinyin input method candidate panel
 */
lv_obj_t * lv_ime_pinyin_get_cand_panel(lv_obj_t * obj)
{
    LV_ASSERT_OBJ(obj, MY_CLASS);

    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    return pinyin_ime->cand_panel;
}

/**
 * Set the dictionary of Pinyin input method.
 * @param obj  pointer to a Pinyin input method object
 * @return     pointer to the Pinyin input method dictionary
 */
lv_pinyin_dict_t * lv_ime_pinyin_get_dict(lv_obj_t * obj)
{
    LV_ASSERT_OBJ(obj, MY_CLASS);

    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    return pinyin_ime->dict;
}

/*=====================
 * Other functions
 *====================*/

/**********************
 *   STATIC FUNCTIONS
 **********************/

static void lv_ime_pinyin_constructor(const lv_obj_class_t * class_p, lv_obj_t * obj)
{
    LV_UNUSED(class_p);
    LV_TRACE_OBJ_CREATE("begin");

    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    uint16_t py_str_i = 0;
    uint16_t btnm_i = 0;
    for(btnm_i = 0; btnm_i < (LV_IME_PINYIN_CAND_TEXT_NUM + 3); btnm_i++)
    {
        if(btnm_i == 0)
        {
            lv_btnm_def_pinyin_sel_map[btnm_i] = "<";
        }
        else if(btnm_i == (LV_IME_PINYIN_CAND_TEXT_NUM + 1)) {
            lv_btnm_def_pinyin_sel_map[btnm_i] = ">";
        }
        else if(btnm_i == (LV_IME_PINYIN_CAND_TEXT_NUM + 2)) {
            lv_btnm_def_pinyin_sel_map[btnm_i] = "";
        }
        else {
            lv_pinyin_cand_str[py_str_i][0] = ' ';
            lv_btnm_def_pinyin_sel_map[btnm_i] = lv_pinyin_cand_str[py_str_i];
            py_str_i++;
        }
    }

    pinyin_ime->mode = LV_IME_PINYIN_MODE_K26;
    pinyin_ime->py_page = 0;
    pinyin_ime->ta_count = 0;
    pinyin_ime->cand_num = 0;
    lv_memset_00(pinyin_ime->input_char, sizeof(pinyin_ime->input_char));
    lv_memset_00(pinyin_ime->py_num, sizeof(pinyin_ime->py_num));
    lv_memset_00(pinyin_ime->py_pos, sizeof(pinyin_ime->py_pos));

    lv_obj_add_flag(obj, LV_OBJ_FLAG_HIDDEN);

    lv_obj_set_size(obj, LV_PCT(100), LV_PCT(55));
    lv_obj_align(obj, LV_ALIGN_BOTTOM_MID, 0, 0);

#if LV_IME_PINYIN_USE_DEFAULT_DICT
    init_pinyin_dict(obj, lv_ime_pinyin_def_dict);
#endif

    /* Init pinyin_ime->cand_panel */
    pinyin_ime->cand_panel = lv_btnmatrix_create(lv_scr_act());
    lv_btnmatrix_set_map(pinyin_ime->cand_panel, (const char **)lv_btnm_def_pinyin_sel_map);
    lv_obj_set_size(pinyin_ime->cand_panel, LV_PCT(100), LV_PCT(5));
    lv_obj_add_flag(pinyin_ime->cand_panel, LV_OBJ_FLAG_HIDDEN);

    lv_btnmatrix_set_one_checked(pinyin_ime->cand_panel, true);
    lv_obj_clear_flag(pinyin_ime->cand_panel, LV_OBJ_FLAG_CLICK_FOCUSABLE);

    /* Set cand_panel style*/
    // Default style
    lv_obj_set_style_bg_opa(pinyin_ime->cand_panel, LV_OPA_0, 0);
    lv_obj_set_style_border_width(pinyin_ime->cand_panel, 0, 0);
    lv_obj_set_style_pad_all(pinyin_ime->cand_panel, 8, 0);
    lv_obj_set_style_pad_gap(pinyin_ime->cand_panel, 0, 0);
    lv_obj_set_style_radius(pinyin_ime->cand_panel, 0, 0);
    lv_obj_set_style_pad_gap(pinyin_ime->cand_panel, 0, 0);
    lv_obj_set_style_base_dir(pinyin_ime->cand_panel, LV_BASE_DIR_LTR, 0);

    // LV_PART_ITEMS style
    lv_obj_set_style_radius(pinyin_ime->cand_panel, 12, LV_PART_ITEMS);
    lv_obj_set_style_bg_color(pinyin_ime->cand_panel, lv_color_white(), LV_PART_ITEMS);
    lv_obj_set_style_bg_opa(pinyin_ime->cand_panel, LV_OPA_0, LV_PART_ITEMS);
    lv_obj_set_style_shadow_opa(pinyin_ime->cand_panel, LV_OPA_0, LV_PART_ITEMS);

    // LV_PART_ITEMS | LV_STATE_PRESSED style
    lv_obj_set_style_bg_opa(pinyin_ime->cand_panel, LV_OPA_COVER, LV_PART_ITEMS | LV_STATE_PRESSED);
    lv_obj_set_style_bg_color(pinyin_ime->cand_panel, lv_color_white(), LV_PART_ITEMS | LV_STATE_PRESSED);

    /* event handler */
    lv_obj_add_event_cb(pinyin_ime->cand_panel, lv_ime_pinyin_cand_panel_event, LV_EVENT_VALUE_CHANGED, obj);
    lv_obj_add_event_cb(obj, lv_ime_pinyin_style_change_event, LV_EVENT_STYLE_CHANGED, NULL);
}


static void lv_ime_pinyin_destructor(const lv_obj_class_t * class_p, lv_obj_t * obj)
{
    LV_UNUSED(class_p);

    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    if(lv_obj_is_valid(pinyin_ime->kb))
        lv_obj_del(pinyin_ime->kb);

    if(lv_obj_is_valid(pinyin_ime->cand_panel))
        lv_obj_del(pinyin_ime->cand_panel);
}


//extern unsigned int buzzer_enable;

static void lv_ime_pinyin_kb_event(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t * kb = lv_event_get_target(e);
    lv_obj_t * obj = lv_event_get_user_data(e);

    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    if(code == LV_EVENT_VALUE_CHANGED) 
    {
        uint16_t btn_id  = lv_btnmatrix_get_selected_btn(kb);
        if(btn_id == LV_BTNMATRIX_BTN_NONE) 
        {
            return;
        }

        const char * txt = lv_btnmatrix_get_btn_text(kb, lv_btnmatrix_get_selected_btn(kb));

        if(txt == NULL) 
        {
            return;
        }

        printf("txt=%s\n\r",txt);

        if (strcmp(txt, "Enter") == 0 || strcmp(txt, LV_SYMBOL_NEW_LINE) == 0)
        {
            pinyin_ime_clear_data(obj);
            lv_obj_add_flag(pinyin_ime->cand_panel, LV_OBJ_FLAG_HIDDEN);
        }
        else if ((strcmp(txt, LV_SYMBOL_BACKSPACE) == 0) || (strcmp(txt, "删除") == 0))
        {
            // del input char
            //buzzer_enable = 1;
            if (pinyin_ime->ta_count > 0)
            {
                if (pinyin_ime->mode == LV_IME_PINYIN_MODE_K26)
                {
                    pinyin_ime->input_char[pinyin_ime->ta_count - 1] = '\0';
                }
                pinyin_ime->ta_count = pinyin_ime->ta_count - 1;
                if (pinyin_ime->ta_count <= 0)
                {
                    lv_obj_add_flag(pinyin_ime->cand_panel, LV_OBJ_FLAG_HIDDEN);
                }
                else if (pinyin_ime->mode == LV_IME_PINYIN_MODE_K26)
                {
                    pinyin_input_proc(obj);
                }
            }
        }
        else if(strcmp(txt, "中文") == 0)
        {
            LV_LOG_ERROR("zhongwen\n\r");
            //buzzer_enable = 1;
            pinyin_ime_clear_data(obj);
        }
        else if(strcmp(txt, "英文") == 0)
        {
            LV_LOG_ERROR("yingwen\n\r");
            //buzzer_enable = 1;
            pinyin_ime_clear_data(obj);
        }
        else if (strcmp(txt, "大小写") == 0)
        {
            LV_LOG_ERROR("daxiaoxie\n\r");
            //buzzer_enable = 1;
            pinyin_ime_clear_data(obj);
        }
        else if(strcmp(txt, LV_SYMBOL_OK) == 0)
        {
            pinyin_ime_clear_data(obj);
        }
        else if((pinyin_ime->mode == LV_IME_PINYIN_MODE_K26) && ((txt[0] >= 'a' && txt[0] <= 'z') || (txt[0] >= 'A' && txt[0] <= 'Z')))
        {
           if ((symbol_type == 0) || (symbol_type == 2))
           {
               strcat(pinyin_ime->input_char, txt);
               pinyin_input_proc(obj);
               pinyin_ime->ta_count++;
           }
           else
           {
               lv_obj_add_flag(pinyin_ime->cand_panel, LV_OBJ_FLAG_HIDDEN);
           }
        }
    }
}


static void lv_ime_pinyin_cand_panel_event(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t * cand_panel = lv_event_get_target(e);
    lv_obj_t * obj = (lv_obj_t *)lv_event_get_user_data(e);

    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    if(code == LV_EVENT_VALUE_CHANGED) {
        uint32_t id = lv_btnmatrix_get_selected_btn(cand_panel);
        if(id == 0) 
        {
            pinyin_page_proc(obj, 0);
            return;
        }
        if(id == (LV_IME_PINYIN_CAND_TEXT_NUM + 1)) {
            pinyin_page_proc(obj, 1);
            return;
        }

        const char * txt = lv_btnmatrix_get_btn_text(cand_panel, id);
        lv_obj_t * ta = lv_keyboard_get_textarea(pinyin_ime->kb);
        uint16_t index = 0;
        for(index = 0; index < pinyin_ime->ta_count; index++)
            lv_textarea_del_char(ta);

        lv_textarea_add_text(ta, txt);

        pinyin_ime_clear_data(obj);
    }
}


static void pinyin_input_proc(lv_obj_t * obj)
{
    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    pinyin_ime->cand_str = pinyin_search_matching(obj, pinyin_ime->input_char, &pinyin_ime->cand_num);
    if(pinyin_ime->cand_str == NULL) {
        return;
    }

    pinyin_ime->py_page = 0;

    for(uint8_t i = 0; i < LV_IME_PINYIN_CAND_TEXT_NUM; i++) {
        memset(lv_pinyin_cand_str[i], 0x00, sizeof(lv_pinyin_cand_str[i]));
        lv_pinyin_cand_str[i][0] = ' ';
    }

    // fill buf
    for(uint8_t i = 0; (i < pinyin_ime->cand_num && i < LV_IME_PINYIN_CAND_TEXT_NUM); i++) {
        for(uint8_t j = 0; j < 3; j++) {
            lv_pinyin_cand_str[i][j] = pinyin_ime->cand_str[i * 3 + j];
        }
    }

    lv_obj_clear_flag(pinyin_ime->cand_panel, LV_OBJ_FLAG_HIDDEN);
}

static void pinyin_page_proc(lv_obj_t * obj, uint16_t dir)
{
    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;
    uint16_t page_num = pinyin_ime->cand_num / LV_IME_PINYIN_CAND_TEXT_NUM;
    uint16_t sur = pinyin_ime->cand_num % LV_IME_PINYIN_CAND_TEXT_NUM;

    if(dir == 0) {
        if(pinyin_ime->py_page) {
            pinyin_ime->py_page--;
        }
    }
    else {
        if(sur == 0) {
            page_num -= 1;
        }
        if(pinyin_ime->py_page < page_num) {
            pinyin_ime->py_page++;
        }
        else return;
    }

    for(uint8_t i = 0; i < LV_IME_PINYIN_CAND_TEXT_NUM; i++) {
        memset(lv_pinyin_cand_str[i], 0x00, sizeof(lv_pinyin_cand_str[i]));
        lv_pinyin_cand_str[i][0] = ' ';
    }

    // fill buf
    uint16_t offset = pinyin_ime->py_page * (3 * LV_IME_PINYIN_CAND_TEXT_NUM);
    for(uint8_t i = 0; (i < pinyin_ime->cand_num && i < LV_IME_PINYIN_CAND_TEXT_NUM); i++) {
        if((sur > 0) && (pinyin_ime->py_page == page_num)) {
            if(i > sur)
                break;
        }
        for(uint8_t j = 0; j < 3; j++) {
            lv_pinyin_cand_str[i][j] = pinyin_ime->cand_str[offset + (i * 3) + j];
        }
    }
}


static void lv_ime_pinyin_style_change_event(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t * obj = lv_event_get_target(e);

    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    if(code == LV_EVENT_STYLE_CHANGED) {
        const lv_font_t * font = lv_obj_get_style_text_font(obj, LV_PART_MAIN);
        lv_obj_set_style_text_font(pinyin_ime->cand_panel, font, 0);
    }
}


static void init_pinyin_dict(lv_obj_t * obj, lv_pinyin_dict_t * dict)
{
    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    char headletter = 'a';
    uint16_t offset_sum = 0;
    uint16_t offset_count = 0;
    uint16_t letter_calc = 0;

    pinyin_ime->dict = dict;

    for(uint16_t i = 0; ; i++) {
        if((NULL == (dict[i].py)) || (NULL == (dict[i].py_mb))) {
            headletter = dict[i - 1].py[0];
            letter_calc = headletter - 'a';
            pinyin_ime->py_num[letter_calc] = offset_count;
            break;
        }

        if(headletter == (dict[i].py[0])) {
            offset_count++;
        }
        else {
            headletter = dict[i].py[0];
            letter_calc = headletter - 'a';
            pinyin_ime->py_num[letter_calc - 1] = offset_count;
            offset_sum += offset_count;
            pinyin_ime->py_pos[letter_calc] = offset_sum;

            offset_count = 1;
        }
    }
}


static char * pinyin_search_matching(lv_obj_t * obj, char * py_str, uint16_t * cand_num)
{
    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    lv_pinyin_dict_t * cpHZ;
    uint8_t index, len = 0, offset;
    volatile uint8_t count = 0;

    if(*py_str == '\0')    return NULL;
    if(*py_str == 'i')     return NULL;
    if(*py_str == 'u')     return NULL;
    if(*py_str == 'v')     return NULL;

    offset = py_str[0] - 'a';
    len = strlen(py_str);

    cpHZ  = &pinyin_ime->dict[pinyin_ime->py_pos[offset]];
    count = pinyin_ime->py_num[offset];

    while(count--) {
        for(index = 0; index < len; index++) {
            if(*(py_str + index) != *((cpHZ->py) + index)) {
                break;
            }
        }

        // perfect match
        if(len == 1 || index == len) {
            // The Chinese character in UTF-8 encoding format is 3 bytes
            * cand_num = strlen((const char *)(cpHZ->py_mb)) / 3;
            return (char *)(cpHZ->py_mb);
        }
        cpHZ++;
    }
    return NULL;
}

static void pinyin_ime_clear_data(lv_obj_t * obj)
{
    lv_ime_pinyin_t * pinyin_ime = (lv_ime_pinyin_t *)obj;

    pinyin_ime->ta_count = 0;
    lv_memset_00(lv_pinyin_cand_str, (sizeof(lv_pinyin_cand_str)));
    lv_memset_00(pinyin_ime->input_char, sizeof(pinyin_ime->input_char));

    lv_obj_add_flag(pinyin_ime->cand_panel, LV_OBJ_FLAG_HIDDEN);
}


#endif  /*LV_USE_IME_PINYIN*/

